[
    {
        "positionName": "Senior PHP Engineer (m/f/d) - Booking platform",
        "salary": null,
        "jobType": [],
        "company": "Flix SE",
        "location": "München",
        "rating": 3.7,
        "reviewsCount": 81,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=04f5df8ab7ec8c90",
        "id": "04f5df8ab7ec8c90",
        "postedAt": "vor 2 Tagen",
        "scrapedAt": "2024-12-02T15:05:34.990Z",
        "postingDateParsed": "2024-11-29T15:25:33.000Z",
        "description": "We're looking for a motivated and driven Senior PHP Engineer to join our Booking platform team in Munich. The vision of the team is to provide an easy, engaging, enjoyable booking experience for all our customers so they love our booking platform. To improve our customers' UX we create an easy-to-use booking workflow in a decoupled system.\n\nMoreover, we invite you to be an active contributor to the Engineering Community and challenge the Status quo at FlixTech!\n\nYou will be joining a cross-functional, agile team of 10 international professionals. Curious to learn more? Read on!\n\nYour Tasks – Paint the world green\nYou will be part of our cross-functional, self-organized team providing an easy, engaging, enjoyable booking experience for all our customers\nYou develop and maintain our large distributed environment\nYou write solid, maintainable, scalable, testable, and tested code and supervise it through all the deployment steps\nYou analyze, propose, and drive technology improvements\nYou support our agile, flexible, team-oriented development\nYour Profile – Ready to hop on board\n7+ years of experience with PHP and solid knowledge of Symfony framework\nExperience with system design and architecture of distributed systems and microservices\nSolid experience with distributed messaging systems (Kafka/SQS/RabbitMQ)\nGood understanding of cloud services (AWS would be a plus)\nExperience with relational databases (e.g. MySQL)\nExperience in unit testing\nBeing familiar with CI/CD best practices\nAPI design\nBachelor or Master in Computer Science, Information Systems or relevant industry experience\nFluent in English\n\nNice to have\n\nSome experience in high-concurrency and high-availability environments\nIaC (Terraform)\nWillingness to grow in/learn:\nDocker, Kubernetes\nMongoDB, Redis\nExperience with Node.js or other back-end technologies would be helpful as we begin the decoupling process\nOur Perks – More than just a job\nYou have an impact. With innovation and smart technology, we are creating the easiest way to travel. We want your ideas and give you autonomy to make them reality.\nFlix is flexible. Organize your own schedule with trust-based hours and up to 60 days of working from (m)anywhere. We are an office-first company, and we encourage all employees to come regularly to their local office.\nTravelling is our passion. Discover the world with your free Flix rides and bring along your friends and family for half price.\nTeamwork makes the dream work. Our FlixTeam has people from over 80 different nations. We work in a multicultural environment where we can challenge and support each other.\nWe're not only green in color. We’re building for the long term, and that means protecting our planet. We constantly test new green technologies and compensate for the CO2 after all our business travel since 2018.\nYour well-being is important to us. To treat your mind and body we will give you a competitive paid time off package, mental health support including 1:1 consultations with a psychologist, and a neat discount on UrbanSportsClub memberships.\n\nWant to rewrite the history of mobility with us? Then join our ride and apply now. We're excited to hear from you!\n\nFlix – A place to enjoy work and have an impact\n\nThe future of transportation is Green. Here at Flix Tech, the R&D group, we develop software with the brightest minds from around the world to engineer new experiences for our millions of customers across our apps and websites. Every day we solve challenging problems, like how to scale rapidly around the world and how to make an experience that delights our customers. We have a culture of sharing ideas, contributing to open source projects and being an active member in our technical communities.\n\nFlix is proud to be an Equal Opportunity Employer. We celebrate diversity and do not discriminate on the basis of race, color, religion, gender (including pregnancy and gender identity), national, social or ethnic origin, political affiliation, sexual orientation, marital status, disability, age, veteran status, or other legally protected characteristics. All employment decisions are based on business needs, job requirements, competence and merit.\n\nWe need your consent to load the YouTube Video service!\n\nWe use a third party service to embed video content that may collect data about your activity. Please review the details and accept the service to watch this video.\n\nMore Information\nAccept\npowered by Usercentrics Consent Management Platform\n\n#LI-Hybrid",
        "descriptionHTML": "<p></p><div><div><p>We're looking for a motivated and driven Senior PHP Engineer to join our Booking platform team in Munich. The vision of the team is to provide an easy, engaging, enjoyable booking experience for all our customers so they love our booking platform. To improve our customers' UX we create an easy-to-use booking workflow in a decoupled system.</p>\n<p>\nMoreover, we invite you to be an active contributor to the Engineering Community and challenge the Status quo at FlixTech!</p>\n<p>\nYou will be joining a cross-functional, agile team of 10 international professionals. Curious to learn more? Read on!</p>\n<p>\nYour Tasks &ndash; Paint the world green</p>\n<ul><li>You will be part of our cross-functional, self-organized team providing an easy, engaging, enjoyable booking experience for all our customers</li>\n<li>You develop and maintain our large distributed environment</li>\n<li>You write solid, maintainable, scalable, testable, and tested code and supervise it through all the deployment steps</li>\n<li>You analyze, propose, and drive technology improvements</li>\n<li>You support our agile, flexible, team-oriented development</li>\n</ul><p>Your Profile &ndash; Ready to hop on board</p>\n<ul><li>7+ years of experience with PHP and solid knowledge of Symfony framework</li>\n<li>Experience with system design and architecture of distributed systems and microservices</li>\n<li>Solid experience with distributed messaging systems (Kafka/SQS/RabbitMQ)</li>\n<li>Good understanding of cloud services (AWS would be a plus)</li>\n<li>Experience with relational databases (e.g. MySQL)</li>\n<li>Experience in unit testing</li>\n<li>Being familiar with CI/CD best practices</li>\n<li>API design</li>\n<li>Bachelor or Master in Computer Science, Information Systems or relevant industry experience</li>\n<li>Fluent in English</li>\n</ul>\n<p>Nice to have</p>\n<ul>\n<li>Some experience in high-concurrency and high-availability environments</li>\n<li>IaC (Terraform)</li>\n<li>Willingness to grow in/learn:\n<ul><li>Docker, Kubernetes</li>\n<li>MongoDB, Redis</li>\n</ul></li><li>Experience with Node.js or other back-end technologies would be helpful as we begin the decoupling process</li>\n</ul><p>Our Perks &ndash; More than just a job</p>\n<ul><li>You have an impact. With innovation and smart technology, we are creating the easiest way to travel. We want your ideas and give you autonomy to make them reality.\n</li><li>Flix is flexible. Organize your own schedule with trust-based hours and up to 60 days of working from (m)anywhere. We are an office-first company, and we encourage all employees to come regularly to their local office.</li>\n<li>Travelling is our passion. Discover the world with your free Flix rides and bring along your friends and family for half price.</li>\n<li>Teamwork makes the dream work. Our FlixTeam has people from over 80 different nations. We work in a multicultural environment where we can challenge and support each other.</li>\n<li>We're not only green in color. We&rsquo;re building for the long term, and that means protecting our planet. We constantly test new green technologies and compensate for the CO2 after all our business travel since 2018.</li>\n<li>Your well-being is important to us. To treat your mind and body we will give you a competitive paid time off package, mental health support including 1:1 consultations with a psychologist, and a neat discount on UrbanSportsClub memberships.</li>\n</ul>\n<p>Want to rewrite the history of mobility with us? Then join our ride and apply now. We're excited to hear from you!</p>\n<p></p>\n<p>Flix &ndash; A place to enjoy work and have an impact</p>\n<p>\nThe future of transportation is Green. Here at Flix Tech, the R&amp;D group, we develop software with the brightest minds from around the world to engineer new experiences for our millions of customers across our apps and websites. Every day we solve challenging problems, like how to scale rapidly around the world and how to make an experience that delights our customers. We have a culture of sharing ideas, contributing to open source projects and being an active member in our technical communities.</p>\n<p>\nFlix is proud to be an Equal Opportunity Employer. We celebrate diversity and do not discriminate on the basis of race, color, religion, gender (including pregnancy and gender identity), national, social or ethnic origin, political affiliation, sexual orientation, marital status, disability, age, veteran status, or other legally protected characteristics. All employment decisions are based on business needs, job requirements, competence and merit.</p><br>\n<p></p>\n<div><div>\n<div><h3 class=\"jobSectionHeader\"><b>We need your consent to load the YouTube Video service!</b></h3><p>\nWe use a third party service to embed video content that may collect data about your activity. Please review the details and accept the service to watch this video.</p><div>\n<p><b>More Information\n</b></p><p><b>Accept\n</b></p></div><div>powered by Usercentrics Consent Management Platform</div></div>\n</div></div><p>#LI-Hybrid</p></div></div>",
        "externalApplyLink": "https://flix.careers/job/7750728002?idOrigine=1522",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Full-stack Software Engineer (React, Node.js)",
        "salary": "Bis zu 85.000 € pro Jahr",
        "jobType": [],
        "company": "DL Remote",
        "location": "81541 München",
        "rating": 0,
        "reviewsCount": 0,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=333aa6f9a80cbb37",
        "id": "333aa6f9a80cbb37",
        "postedAt": "vor 2 Tagen",
        "scrapedAt": "2024-12-02T15:05:44.818Z",
        "postingDateParsed": "2024-11-30T04:55:31.000Z",
        "description": "We are currently staffing a Full-stack Software Engineer Role @ a well funded e-health SaaS company.\n\nIn this role, you will develop and improve their software suite with a focus on optimizing workflows and the user experience.\n\nDecent Experience with JavaScript / Typescript, React.js and Node.js are required to excel in this role. React Native experiences are very helpful as well, yet not mandatory.\n\nAdditionally, you should have top German and English language skills (C1).\n\n| COMPANY\n\nThis B2C vertical ehealth company has closed a funding round of ~ €5 million a year after announcing a €2 million funding round. They have a partnership with their market-leading counterpart in the US, which allows them to build the product and business more efficiently and much faster.\n\nThey are growing the team in all key positions.\n\n| REMOTE WORK POLICY\n\nIn this role, you can work fully remotely from Germany or Austria.\n\n| WHAT YOU WILL GET\n\nThe opportunity to shape the software platform of a well-positioned e-health company, which is about to disrupt their industry vertical in Europe\n\nExcellent personal & career growth options\n\nUp to 85k€ annual salary\n\nFully remote role with a high degree of decision-making autonomy and a very solid financial backing\n\n| NEXT STEPS\n\nIf you are interested in this role, we will share additional information about the company and position to support your decision-making process and invite you to a first chat with the head of engineering.",
        "descriptionHTML": "We are currently staffing a Full-stack Software Engineer Role @ a well funded e-health SaaS company.\n<br><br>\nIn this role, you will develop and improve their software suite with a focus on optimizing workflows and the user experience.\n<br><br>\nDecent Experience with JavaScript / Typescript, React.js and Node.js are required to excel in this role. React Native experiences are very helpful as well, yet not mandatory.\n<br><br>\nAdditionally, you should have top German and English language skills (C1).\n<br><br>\n| COMPANY\n<br><br>\nThis B2C vertical ehealth company has closed a funding round of ~ €5 million a year after announcing a €2 million funding round. They have a partnership with their market-leading counterpart in the US, which allows them to build the product and business more efficiently and much faster.\n<br><br>\nThey are growing the team in all key positions.\n<br><br>\n| REMOTE WORK POLICY\n<br><br>\nIn this role, you can work fully remotely from Germany or Austria.\n<br><br>\n| WHAT YOU WILL GET\n<br><br>\nThe opportunity to shape the software platform of a well-positioned e-health company, which is about to disrupt their industry vertical in Europe\n<br><br>\nExcellent personal & career growth options\n<br><br>\nUp to 85k€ annual salary\n<br><br>\nFully remote role with a high degree of decision-making autonomy and a very solid financial backing\n<br><br>\n| NEXT STEPS\n<br><br>\nIf you are interested in this role, we will share additional information about the company and position to support your decision-making process and invite you to a first chat with the head of engineering.",
        "externalApplyLink": "https://jobs.dl-remote.com/jobs/5262002-full-stack-software-engineer-react-node-js?ittk=HFRWTQQZWD",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Systems Engineer Germany",
        "salary": null,
        "jobType": [],
        "company": "Pure Storage",
        "location": "München",
        "rating": 3.6,
        "reviewsCount": 62,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=3566704b2057048b",
        "id": "3566704b2057048b",
        "postedAt": "vor 2 Tagen",
        "scrapedAt": "2024-12-02T15:06:00.390Z",
        "postingDateParsed": "2024-11-29T20:19:34.000Z",
        "description": "BE PART OF BUILDING THE FUTURE.\n\nWhat do NASA and emerging space companies have in common with COVID vaccine R&D teams or with Roblox and the Metaverse?\n\nThe answer is data, - all fast moving, fast growing industries rely on data for a competitive edge in their industries. And the most advanced companies are realizing the full data advantage by partnering with Pure Storage. Pure's vision is to redefine the storage experience and empower innovators by simplifying how people consume and interact with data. With 11,000+ customers including 58% of the Fortune 500, we've only scratched the surface of our ambitions.\n\nPure is blazing trails and setting records:\n\nFor ten straight years, Gartner has named Pure a leader in the Magic Quadrant\nOur customer-first culture and unwavering commitment to innovation have earned us a certified Net Promoter Score in the top 1% of B2B companies globally\nIndustry analysts and press applaud Pure's leadership across these dimensions\nAnd, our 5,000+ employees are emboldened to make Pure a faster, stronger, smarter company as we go\n\nIf you, like us, say \"bring it on\" to exciting challenges that change the world, we have endless opportunities where you can make your mark.\n\nA Career within Sales / Systems Engineering\n\nWe're always looking for great talent to join our growing team in EMEA. Although we may not have an open position right now, if you are interested in this opportunity we encourage you to apply.\n\nWhat happen's next..\n\nWe'll carefully review your application and if we believe we may have a role in the near future that could be a good match with your experience and qualifications, we will get in touch and may invite you to an introductory call with a member of our talent acquisition team.\n\nAs a Presales Systems Engineer you will leverage your technical expertise to pilot the sales & adoption of our PURE solutions with prospects and existing customers in the Enterprise, Commercial or Public sector.\n\nYou collaborate with customers to understand their business goals, their pain points, and propose creative solutions in collaboration with our key alliance partners. You will work closely with other pre-sales, sales, partner sales & enablement, marketing, and leadership team members to help develop and grow business with the full PURE portfolio of solutions.\n\nSHOULD YOU ACCEPT THIS CHALLENGE...\n\nDevelop an exhaustive understanding of what drives a customer's business and what motivates their decision making\nConnect the dots from technology solutions, inclusive of the Pure Storage portfolio and others from the ecosystem, to measurable customer business outcomes\nPartner closely with account managers, specialists and channel partners to create a seamless and holistic customer experience and strategy to drive revenue growth and net new business\nPassionately bring to light the advantages of a Pure Storage solution\nRefine sales strategy and tactics, taking command of technical responsibilities\nDelight customers and teammates with your technical leadership and domain expertise on storage products, distributed storage architectures, file systems, and competitive storage offerings in the DAS, NAS and SAN product spaces\nTake control of evaluations, benchmarks and system configurations\nBuild and deliver technical product and architecture presentations with vigor to customers and lock in the technical win with clients and prospective accounts\nCapture requirements and translate Customer's business needs into innovative solutions to accelerate their growth and capacity\nAuthor responses to RFI & RFPs\nSeek out and spur new opportunities for interoperability, functional, and performance testing/validation\nPromote mutual roadmap and planning exchanges\nLiaise with product and technical marketing to produce materials (i.e. whitepaper, web presentations) that support overall alliance plans and objectives\nStay current with the competition and ensure that materials accurately reflect the latest, differentiated solution positioning\nMove with market trends and competitive landscape to promote thought leadership within our organization\nLead by example living the Pure Values: Persistence, Creativity, Teamwork, Ownership and Customer-first\n\nWHAT YOU'LL NEED TO BRING TO THIS ROLE...\n\nCreativity, empathy, an open mind, curiosity and a desire for continuous learning\nPre-sales experience is required\n5 or more years of relevant experience, mixed among technology, design, and communications required. Experience supporting the sales of enterprise storage, networking, systems, cloud, or software to enterprise accounts preferred\nDeep understanding of the architecture, design and implementation of multi-tiered client/server and web-based computing solutions\nPrior experience in targeting new prospects and converting them into clients\nContribute significant portions and/or lead responses to RFPs, RFQs and RFIs\nSuperior knowledge of current and emerging storage architectures (FC, iSCSI, NAS, OSD, SAN)\nLinux, NFS file systems and Linux distributed network environment\nFamiliarity with AWS, Azure, GCP a plus\nInstallation/configuration of distributed computing, multiprocessing, virtual memory subsystem, storage subsystems architecture, shared memory architectures, cache architectures, windowing systems\nFamiliarity with containers, k8s and microservices architectures a plus\nStrong knowledge of digital transformation to a Cloud Native architecture, On-Prem, Public Cloud, Provisioning Automation, and Containers\nKnowledge of VMware, Local Area Networking, Ethernet, TCP/IP and general networking\nExcellent verbal and written interpersonal skills\nBS in CS, EE or other technical degree and/or equivalent experience\nMust have a familiarity with modern web architecture a plus (LAMP stack, scale-out vs scale-up architectures, AWS well-architected framework, microservices architecture)\nCuriosity and passion around technology and explaining and showing new technology platforms and concepts to customers\nFamiliarity with storage-intensive applications and their requirements such as structured databases (SQL, Oracle) is highly desirable\nFluency in German and English\n\n#LI-REMOTE\n\nBE YOU—CORPORATE CLONES NEED NOT APPLY.\n\nPure is where you ask big questions, think differently, and make an impact. This is not just a job, but a place where you have a voice and can accelerate your career. We value unique thoughts and celebrate individuality, and with ample opportunity to learn, develop yourself, and expand into different roles, joining Pure is an investment in your career journey.\n\nThrough our Pure Equality program, which supports a flourishing field of employee resource groups, we nourish the personal and professional lives of our team members. And our Pure Good Foundation gives back to local and global communities through volunteering and grants.\n\nAnd because we understand the value of bringing your full and best self to work, we offer a variety of perks to manage a healthy balance, including flexible time off, wellness resources, and company-sponsored team events.\n\nPURE IS COMMITTED TO EQUALITY.\n\nResearch shows that in order to apply for a job, women feel they need to meet 100% of the criteria while men usually apply after meeting about 60%. Regardless of how you identify, if you believe you can do the job and are a good match, we encourage you to apply.\n\nPure is proud to be an equal opportunity and affirmative action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or any other characteristic legally protected by the laws of the jurisdiction in which you are being considered for hire.\n\nIf you need assistance or an accommodation due to a disability, you may contact us at TA-Ops@purestorage.com.\n\nAPPLICANT & CANDIDATE PERSONAL INFORMATION PRIVACY NOTICE.\n\nIf you're wondering how or why Pure collects or uses information you provide, we invite you to check out our Applicant & Candidate Personal Information Protection Notice.\n\nDEEMED EXPORT LICENSE NOTICE.\n\nSome positions may require a deemed export license for compliance with applicable laws and regulations. Please note: Pure does not currently sponsor deemed export license applications so we are unable to proceed with applicants requiring stated sponsorship.",
        "descriptionHTML": "<p></p><div><div><div><b>BE PART OF BUILDING THE FUTURE.</b></div>\n<p>\nWhat do NASA and emerging space companies have in common with COVID vaccine R&amp;D teams or with Roblox and the Metaverse?</p>\n<p>\nThe answer is data, - all fast moving, fast growing industries rely on data for a competitive edge in their industries. And the most advanced companies are realizing the full data advantage by partnering with Pure Storage. Pure's vision is to redefine the storage experience and empower innovators by simplifying how people consume and interact with data. With 11,000+ customers including 58% of the Fortune 500, we've only scratched the surface of our ambitions.</p>\n<p>\nPure is blazing trails and setting records:</p>\n<ul>\n<li>For ten straight years, Gartner has named Pure a leader in the Magic Quadrant</li>\n<li>Our customer-first culture and unwavering commitment to innovation have earned us a certified Net Promoter Score in the top 1% of B2B companies globally</li>\n<li>Industry analysts and press applaud Pure's leadership across these dimensions</li>\n<li>And, our 5,000+ employees are emboldened to make Pure a faster, stronger, smarter company as we go</li><br>\n</ul>\n<div>If you, like us, say &quot;bring it on&quot; to exciting challenges that change the world, we have endless opportunities where you can make your mark.</div></div><p><b>\nA Career within </b><b>Sales / Systems Engineering</b></p>\n<p>\nWe're always looking for great talent to join our growing team in EMEA. Although we may not have an open position right now, if you are interested in this opportunity we encourage you to apply.</p>\n<p><b>\nWhat happen's next..</b></p>\n<p>\nWe'll carefully review your application and if we believe we may have a role in the near future that could be a good match with your experience and qualifications, we will get in touch and may invite you to an introductory call with a member of our talent acquisition team.</p>\n<p>\nAs a Presales Systems Engineer you will leverage your technical expertise to pilot the sales &amp; adoption of our PURE solutions with prospects and existing customers in the Enterprise, Commercial or Public sector.</p><br>\n<p></p>\n<p>\nYou collaborate with customers to understand their business goals, their pain points, and propose creative solutions in collaboration with our key alliance partners. You will work closely with other pre-sales, sales, partner sales &amp; enablement, marketing, and leadership team members to help develop and grow business with the full PURE portfolio of solutions.</p>\n<p><b>\nSHOULD YOU ACCEPT THIS CHALLENGE...</b></p><br>\n<ul>\n<li>Develop an exhaustive understanding of what drives a customer's business and what motivates their decision making</li>\n<li>Connect the dots from technology solutions, inclusive of the Pure Storage portfolio and others from the ecosystem, to measurable customer business outcomes</li>\n<li>Partner closely with account managers, specialists and channel partners to create a seamless and holistic customer experience and strategy to drive revenue growth and net new business</li>\n<li>Passionately bring to light the advantages of a Pure Storage solution</li>\n<li>Refine sales strategy and tactics, taking command of technical responsibilities</li>\n<li>Delight customers and teammates with your technical leadership and domain expertise on storage products, distributed storage architectures, file systems, and competitive storage offerings in the DAS, NAS and SAN product spaces</li>\n<li>Take control of evaluations, benchmarks and system configurations</li>\n<li>Build and deliver technical product and architecture presentations with vigor to customers and lock in the technical win with clients and prospective accounts</li>\n<li>Capture requirements and translate Customer's business needs into innovative solutions to accelerate their growth and capacity</li>\n<li>Author responses to RFI &amp; RFPs</li>\n<li>Seek out and spur new opportunities for interoperability, functional, and performance testing/validation</li>\n<li>Promote mutual roadmap and planning exchanges</li>\n<li>Liaise with product and technical marketing to produce materials (i.e. whitepaper, web presentations) that support overall alliance plans and objectives</li>\n<li>Stay current with the competition and ensure that materials accurately reflect the latest, differentiated solution positioning</li>\n<li>Move with market trends and competitive landscape to promote thought leadership within our organization</li>\n<li>Lead by example living the Pure Values: Persistence, Creativity, Teamwork, Ownership and Customer-first</li>\n</ul>\n<p><b>WHAT YOU'LL NEED TO BRING TO THIS ROLE...</b></p>\n<ul>\n<li>Creativity, empathy, an open mind, curiosity and a desire for continuous learning</li>\n<li>Pre-sales experience is required</li>\n<li>5 or more years of relevant experience, mixed among technology, design, and communications required. Experience supporting the sales of enterprise storage, networking, systems, cloud, or software to enterprise accounts preferred</li>\n<li>Deep understanding of the architecture, design and implementation of multi-tiered client/server and web-based computing solutions</li>\n<li>Prior experience in targeting new prospects and converting them into clients</li>\n<li>Contribute significant portions and/or lead responses to RFPs, RFQs and RFIs</li>\n<li>Superior knowledge of current and emerging storage architectures (FC, iSCSI, NAS, OSD, SAN)</li>\n<li>Linux, NFS file systems and Linux distributed network environment</li>\n<li>Familiarity with AWS, Azure, GCP a plus</li>\n<li>Installation/configuration of distributed computing, multiprocessing, virtual memory subsystem, storage subsystems architecture, shared memory architectures, cache architectures, windowing systems</li>\n<li>Familiarity with containers, k8s and microservices architectures a plus</li>\n<li>Strong knowledge of digital transformation to a Cloud Native architecture, On-Prem, Public Cloud, Provisioning Automation, and Containers</li>\n<li>Knowledge of VMware, Local Area Networking, Ethernet, TCP/IP and general networking</li>\n<li>Excellent verbal and written interpersonal skills</li>\n<li>BS in CS, EE or other technical degree and/or equivalent experience</li>\n<li>Must have a familiarity with modern web architecture a plus (LAMP stack, scale-out vs scale-up architectures, AWS well-architected framework, microservices architecture)</li>\n<li>Curiosity and passion around technology and explaining and showing new technology platforms and concepts to customers</li>\n<li>Familiarity with storage-intensive applications and their requirements such as structured databases (SQL, Oracle) is highly desirable</li>\n<li>Fluency in German and English</li></ul><br>\n<p></p>\n<p>\n#LI-REMOTE</p><p></p><div><br>\n<p><b>\nBE YOU&mdash;CORPORATE CLONES NEED NOT APPLY.</b></p><br>\n<p></p>\n<div>\nPure is where you ask big questions, think differently, and make an impact. This is not just a job, but a place where you have a voice and can accelerate your career. We value unique thoughts and celebrate individuality, and with ample opportunity to learn, develop yourself, and expand into different roles, joining Pure is an investment in your career journey.</div><br>\n<div></div>\n<div>\nThrough our Pure Equality program, which supports a flourishing field of employee resource groups, we nourish the personal and professional lives of our team members. And our Pure Good Foundation gives back to local and global communities through volunteering and grants.</div><br>\n<div></div>\n<div>\nAnd because we understand the value of bringing your full and best self to work, we offer a variety of perks to manage a healthy balance, including flexible time off, wellness resources, and company-sponsored team events.</div><br>\n<div></div>\n<div><b>\nPURE IS COMMITTED TO EQUALITY.</b></div>\n<div>\nResearch shows that in order to apply for a job, women feel they need to meet 100% of the criteria while men usually apply after meeting about 60%. Regardless of how you identify, if you believe you can do the job and are a good match, we encourage you to apply.</div><br>\n<div>\nPure is proud to be an equal opportunity and affirmative action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or any other characteristic legally protected by the laws of the jurisdiction in which you are being considered for hire.</div><br>\n<div></div>\n<div>\nIf you need assistance or an accommodation due to a disability, you may contact us at <b>TA-Ops@purestorage.com</b>.</div><br>\n<div></div>\n<div><b>\nAPPLICANT &amp; CANDIDATE PERSONAL INFORMATION PRIVACY NOTICE.</b></div>\n<div>\nIf you're wondering how or why Pure collects or uses information you provide, we invite you to check out our Applicant &amp; Candidate Personal Information Protection Notice.</div>\n<div><b>\nDEEMED EXPORT LICENSE NOTICE.</b></div>\n<div>\nSome positions may require a deemed export license for compliance with applicable laws and regulations. Please note: Pure does not currently sponsor deemed export license applications so we are unable to proceed with applicants requiring stated sponsorship.</div></div></div>",
        "externalApplyLink": null,
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Senior PHP Engineer (m/f/d) - Booking platform",
        "salary": null,
        "jobType": [],
        "company": "Flix",
        "location": "München",
        "rating": 3.7,
        "reviewsCount": 9,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=54afc8d206ef76eb",
        "id": "54afc8d206ef76eb",
        "postedAt": "vor 3 Tagen",
        "scrapedAt": "2024-12-02T15:06:03.520Z",
        "postingDateParsed": "2024-11-29T10:30:17.000Z",
        "description": "We're looking for a motivated and driven Senior PHP Engineer to join our Booking platform team in Munich. The vision of the team is to provide an easy, engaging, enjoyable booking experience for all our customers so they love our booking platform. To improve our customers' UX we create an easy-to-use booking workflow in a decoupled system.\n\nMoreover, we invite you to be an active contributor to the Engineering Community and challenge the Status quo at FlixTech!\n\nYou will be joining a cross-functional, agile team of 10 international professionals. Curious to learn more? Read on!\n\nYour Tasks – Paint the world green\nYou will be part of our cross-functional, self-organized team providing an easy, engaging, enjoyable booking experience for all our customers\nYou develop and maintain our large distributed environment\nYou write solid, maintainable, scalable, testable, and tested code and supervise it through all the deployment steps\nYou analyze, propose, and drive technology improvements\nYou support our agile, flexible, team-oriented development\nYour Profile – Ready to hop on board\n7+ years of experience with PHP and solid knowledge of Symfony framework\nExperience with system design and architecture of distributed systems and microservices\nSolid experience with distributed messaging systems (Kafka/SQS/RabbitMQ)\nGood understanding of cloud services (AWS would be a plus)\nExperience with relational databases (e.g. MySQL)\nExperience in unit testing\nBeing familiar with CI/CD best practices\nAPI design\nBachelor or Master in Computer Science, Information Systems or relevant industry experience\nFluent in English\n\nNice to have\n\nSome experience in high-concurrency and high-availability environments\nIaC (Terraform)\nWillingness to grow in/learn:\nDocker, Kubernetes\nMongoDB, Redis\nExperience with Node.js or other back-end technologies would be helpful as we begin the decoupling process\nOur Perks – More than just a job\nYou have an impact. With innovation and smart technology, we are creating the easiest way to travel. We want your ideas and give you autonomy to make them reality.\nFlix is flexible. Organize your own schedule with trust-based hours and up to 60 days of working from (m)anywhere. We are an office-first company, and we encourage all employees to come regularly to their local office.\nTravelling is our passion. Discover the world with your free Flix rides and bring along your friends and family for half price.\nTeamwork makes the dream work. Our FlixTeam has people from over 80 different nations. We work in a multicultural environment where we can challenge and support each other.\nWe're not only green in color. We're building for the long term, and that means protecting our planet. We constantly test new green technologies and compensate for the CO2 after all our business travel since 2018.\nYour well-being is important to us. To treat your mind and body we will give you a competitive paid time off package, mental health support including 1:1 consultations with a psychologist, and a neat discount on UrbanSportsClub memberships.\n\nWant to rewrite the history of mobility with us? Then join our ride and apply now. We're excited to hear from you!\n\nFlix – A place to enjoy work and have an impact\n\nThe future of transportation is Green. Here at Flix Tech, the R&D group, we develop software with the brightest minds from around the world to engineer new experiences for our millions of customers across our apps and websites. Every day we solve challenging problems, like how to scale rapidly around the world and how to make an experience that delights our customers. We have a culture of sharing ideas, contributing to open source projects and being an active member in our technical communities.\n\nFlix is proud to be an Equal Opportunity Employer. We celebrate diversity and do not discriminate on the basis of race, color, religion, gender (including pregnancy and gender identity), national, social or ethnic origin, political affiliation, sexual orientation, marital status, disability, age, veteran status, or other legally protected characteristics. All employment decisions are based on business needs, job requirements, competence and merit.\n\n#LI-Hybrid",
        "descriptionHTML": "<div><p>We're looking for a motivated and driven <b>Senior PHP Engineer </b>to join our<b> Booking platform team </b>in Munich. The vision of the team is to provide an easy, engaging, enjoyable booking experience for all our customers so they love our booking platform. To improve our customers' UX we create an easy-to-use booking workflow in a decoupled system.</p>\n<p>\nMoreover, we invite you to be an active contributor to the Engineering Community and challenge the Status quo at FlixTech!</p>\n<p>\nYou will be joining a cross-functional, agile team of 10 international professionals. Curious to learn more? Read on!</p>\n<h3 class=\"jobSectionHeader\"><b>\nYour Tasks &ndash; Paint the world green</b></h3>\n<ul><li>You will be part of our cross-functional, self-organized team providing an easy, engaging, enjoyable booking experience for all our customers</li>\n<li>You develop and maintain our large distributed environment</li>\n<li>You write solid, maintainable, scalable, testable, and tested code and supervise it through all the deployment steps</li>\n<li>You analyze, propose, and drive technology improvements</li>\n<li>You support our agile, flexible, team-oriented development</li>\n</ul><h3 class=\"jobSectionHeader\"><b>Your Profile &ndash; Ready to hop on board</b></h3>\n<ul><li>7+ years of experience with PHP and solid knowledge of Symfony framework</li>\n<li>Experience with system design and architecture of distributed systems and microservices</li>\n<li>Solid experience with distributed messaging systems (Kafka/SQS/RabbitMQ)</li>\n<li>Good understanding of cloud services (AWS would be a plus)</li>\n<li>Experience with relational databases (e.g. MySQL)</li>\n<li>Experience in unit testing</li>\n<li>Being familiar with CI/CD best practices</li>\n<li>API design</li>\n<li>Bachelor or Master in Computer Science, Information Systems or relevant industry experience</li>\n<li>Fluent in English</li>\n</ul>\n<p><b>Nice to have</b></p>\n<ul>\n<li>Some experience in high-concurrency and high-availability environments</li>\n<li>IaC (Terraform)</li>\n<li>Willingness to grow in/learn:\n<ul><li>Docker, Kubernetes</li>\n<li>MongoDB, Redis</li>\n</ul></li><li>Experience with Node.js or other back-end technologies would be helpful as we begin the decoupling process</li>\n</ul><h3 class=\"jobSectionHeader\"><b>Our Perks &ndash; More than just a job</b></h3>\n<ul><li>You have an impact. With innovation and smart technology, we are creating the easiest way to travel. We want your ideas and give you autonomy to make them reality.\n</li><li>Flix is flexible. Organize your own schedule with trust-based hours and up to 60 days of working from (m)anywhere. We are an office-first company, and we encourage all employees to come regularly to their local office.</li>\n<li>Travelling is our passion. Discover the world with your free Flix rides and bring along your friends and family for half price.</li>\n<li>Teamwork makes the dream work. Our FlixTeam has people from over 80 different nations. We work in a multicultural environment where we can challenge and support each other.</li>\n<li>We're not only green in color. We're building for the long term, and that means protecting our planet. We constantly test new green technologies and compensate for the CO2 after all our business travel since 2018.</li>\n<li>Your well-being is important to us. To treat your mind and body we will give you a competitive paid time off package, mental health support including 1:1 consultations with a psychologist, and a neat discount on UrbanSportsClub memberships.</li>\n</ul>\n<p><b>Want to rewrite the history of mobility with us? Then join our ride and apply now. We're excited to hear from you!</b></p>\n<p></p>\n<p><b>Flix &ndash; A place to enjoy work and have an impact</b></p>\n<p>\nThe future of transportation is Green. Here at Flix Tech, the R&amp;D group, we develop software with the brightest minds from around the world to engineer new experiences for our millions of customers across our apps and websites. Every day we solve challenging problems, like how to scale rapidly around the world and how to make an experience that delights our customers. We have a culture of sharing ideas, contributing to open source projects and being an active member in our technical communities.</p>\n<p>\nFlix is proud to be an Equal Opportunity Employer. We celebrate diversity and do not discriminate on the basis of race, color, religion, gender (including pregnancy and gender identity), national, social or ethnic origin, political affiliation, sexual orientation, marital status, disability, age, veteran status, or other legally protected characteristics. All employment decisions are based on business needs, job requirements, competence and merit.</p><br>\n<p></p>\n<p></p>\n<p><b>#LI-Hybrid</b></p></div>",
        "externalApplyLink": null,
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Software Engineer, Core Languages/Python",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "Google",
        "location": "München",
        "rating": 4.3,
        "reviewsCount": 5753,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=4b95922e0af56973",
        "id": "4b95922e0af56973",
        "postedAt": "vor 4 Tagen",
        "scrapedAt": "2024-12-02T15:06:03.711Z",
        "postingDateParsed": "2024-11-28T02:21:29.000Z",
        "description": "Minimum qualifications:\n\n• Bachelor’s degree or equivalent practical experience.\n• 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.\n• 2 years of experience with data structures or algorithms.\n• Experience coding with C++, Python, and Go.\n\nPreferred qualifications:\n\n• Experience with language infrastructure (e.g., linters, languages, build rules).\n• Experience with Python internals like CPython and type checkers such as Pytype or Mypy.\n• Open source experience (e.g. making pull requests on developer platforms).\n\nAbout the job\n\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\nThe Core team builds the technical foundation behind Google’s flagship products. We are owners and advocates for the underlying design elements, developer platforms, product components, and infrastructure at Google. These are the essential building blocks for excellent, safe, and coherent experiences for our users and drive the pace of innovation for every developer. We look across Google’s products to build central solutions, break down technical barriers and strengthen existing systems. As the Core team, we have a mandate and a unique opportunity to impact important technical decisions across the company.\n\nResponsibilities\n\n• Provide language availability and interact with fundamental production technologies and tooling support for our Python users.\n• Assist Python users to build, optimize, and debug their lines of Python code at Google.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See alsoGoogle's EEO Policy andEEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing ourAccommodations for Applicants form.",
        "descriptionHTML": "<b>Minimum qualifications:</b><br>\n<ul>\n<li>Bachelor’s degree or equivalent practical experience.</li>\n<li>2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.</li>\n<li>2 years of experience with data structures or algorithms.</li>\n<li>Experience coding with C++, Python, and Go.</li>\n</ul>\n<b>Preferred qualifications:</b><br>\n<ul>\n<li>Experience with language infrastructure (e.g., linters, languages, build rules).</li>\n<li>Experience with Python internals like CPython and type checkers such as Pytype or Mypy.</li>\n<li>Open source experience (e.g. making pull requests on developer platforms).</li>\n</ul>\nAbout the job\n<br><br>\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\n<br>The Core team builds the technical foundation behind Google’s flagship products. We are owners and advocates for the underlying design elements, developer platforms, product components, and infrastructure at Google. These are the essential building blocks for excellent, safe, and coherent experiences for our users and drive the pace of innovation for every developer. We look across Google’s products to build central solutions, break down technical barriers and strengthen existing systems. As the Core team, we have a mandate and a unique opportunity to impact important technical decisions across the company.\n<br><br>\nResponsibilities\n<br><br>\n<ul>\n<li>Provide language availability and interact with fundamental production technologies and tooling support for our Python users.</li>\n<li>Assist Python users to build, optimize, and debug their lines of Python code at Google.</li>\n</ul>\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See alsoGoogle's EEO Policy andEEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing ourAccommodations for Applicants form.",
        "externalApplyLink": "https://de.indeed.com/rc/clk?jk=4b95922e0af56973&bb=fsM58BdR5HRjiELzLkKjqd3armoxb_rS6wqK6P7vrKdw90zmqR1CmYS1C2mXNio9&xkcb=SoBk67M34D1OdSwB3B0NbzkdCdPP&fromas=1&xpse=SoCO67I34D1OLjSgCx0LbzkdCdPP&xfps=62bc53ad-2c41-4e60-b135-eeef1c0aa7a4",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Senior Software Engineer Defence - Test Automation (f/m/d)",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "Capgemini Engineering",
        "location": "München",
        "rating": 3.3,
        "reviewsCount": 998,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=fdb9601756fa498a",
        "id": "fdb9601756fa498a",
        "postedAt": "vor 3 Tagen",
        "scrapedAt": "2024-12-02T15:06:04.684Z",
        "postingDateParsed": "2024-11-29T10:17:44.000Z",
        "description": "Job Description\n\nWelcome to Capgemini Engineering, the world leader in engineering and R&D projects. As a consulting and services company, we help the world's most innovative companies realise their full potential: From autonomous cars to life-saving robots, we think outside the box across a wide range of industries.\n\nWe are looking for you to join our Software Engineering team to test breakthrough products and platforms using leading software technologies! Build tool chain for testing embedded software in physical products (e.g. ECUs), design the lifecycle of customer-facing.\n\nJoin us and take the opportunity to shape your career at Capgemini Engineering and experience every working day with enthusiasm!\n\nYOUR TASKS AND RESPONSIBILITIES WITH US:\n\nIndependent development and optimization of software testing procedures for safety-critical electronic systems (e.g., military radar systems).\nLeading and executing software tests, as well as performing verification and validation.\nAutomation of complex testing procedures and processes.\nAnalysis and design of requirements, ensuring quality and compliance.\nCoordination of project teams and collaboration with interdisciplinary groups, such as software development, electronics, and safety engineers.\n\nYOU CONVINCE US WITH:\n\nUniversity degree in Computer Science, Electrical Engineering, Engineering, or a related field, and at least 5 years of professional experience in software testing development, integration, and verification according to DO-178B/C or comparable standards in safety-critical projects.\nIn-depth knowledge of development processes (e.g., V-Model).\nExperience in development environment on Windows and preferably Linux operating systems.\nProficiency in programming languages (Python, C++, C, Java, or Rust) and test automation. Experience in Test- and Requirements Management Tools like DOORS.\nLeadership skills, structured working methods, and fluent English proficiency, ideally German.\nWillingness to travel for project purposes and undergo a security clearance according to LuftSiG §7, including obtaining a Ü2 security clearance..\n\nNot a 100% match? No need to worry! Capgemini Engineering supports you with a wide range of learning opportunities so that you can develop both professionally and personally.\n\nWE LOOK FORWARD TO MEETING YOU\n\nDo you have any questions about the job profile and/or requirements?\nPlease get in touch with your contact person in Recruiting.\nMelike Ilhan, Recruiter Capgemini Engineering Deutschland S.A.S. & Co. KG\n+49 15203965190\nmelike.ilhan@capgemini.com\nPlease fill in our online application form completely and attach your CV, work and school certificates as well as any other relevant documents.\nWe wish you every success for your application.\n\nCompany Description\n\nCapgemini Engineering is a global market leader in engineering and R&D services. With cutting-edge digital technologies and innovative software, we are shaping the intelligent industry of tomorrow: on the road, in the air, on the seas, in rail transport, in energy production as well as in the fields of life science, telecommunications, semiconductors, electronics and finance. We are more than 65,000 engineers and scientists in over 30 countries.\n\nCapgemini Engineering is committed to the employment of a diverse workforce. Qualified applicants are considered regardless of their origin, skin colour, religion, gender, age, sexual orientation, gender identity, gender expression, veteran status or disability.\n\nGET THE FUTURE YOU WANT! We look forward to hearing from you!\n\nBenefits\n\nIndividueller Karriereplan\nVielfältiges Weiterbildungsangebot\nIndustrieübergreifender Wissenstransfer\nE-Gym WellPass\nNachhaltig unterwegs - Das JobRad-Programm\nEinkaufsvorteile und Rabattaktionen\nZahlreiche Events\nAttraktives Mitarbeiterbeteiligungsprogramm\nBetriebliche Altersvorsorge\nMobiles Arbeiten nach Absprache (In- und Ausland)\nIndividuelle Arbeits- und Teilzeitmodelle\nWertorientierte Unternehmenskultur\nIndividual career plan\nDiverse range of further trainings\nCross-industry knowledge transfer\nE-Gym WellPass\nSustainable on the road - the JobRad program\nShopping advantages and discount promotions\nNumerous events\nAttractive employee stock ownership program\nCompany pension plan\nMobile work by arrangements (domestic and abroad)\nIndividual work and part-time models\nValue oriented corporate culture",
        "descriptionHTML": "<div><h2 class=\"jobSectionHeader\"><b>Job Description</b></h2><p><b><br>\nWelcome to Capgemini Engineering, the world leader in engineering and R&amp;D projects.</b> As a consulting and services company, we help the world's most innovative companies realise their full potential: From autonomous cars to life-saving robots, we think outside the box across a wide range of industries.</p>\n<p><b>\nWe are looking for you to join our Software Engineering team</b> to test breakthrough products and platforms using leading software technologies! Build tool chain for testing embedded software in physical products (e.g. ECUs), design the lifecycle of customer-facing.</p>\n<p><b>\nJoin us and take the opportunity to shape your career at Capgemini Engineering and experience every working day with enthusiasm!</b></p>\n<p></p>\n<p><b>YOUR TASKS AND RESPONSIBILITIES WITH US:</b></p>\n<ul>\n<li>Independent development and optimization of software testing procedures for safety-critical electronic systems (e.g., military radar systems).</li><li>\nLeading and executing software tests, as well as performing verification and validation.</li><li>\nAutomation of complex testing procedures and processes.</li><li>\nAnalysis and design of requirements, ensuring quality and compliance.</li><li>\nCoordination of project teams and collaboration with interdisciplinary groups, such as software development, electronics, and safety engineers.</li>\n</ul><p><b>YOU CONVINCE US WITH:</b></p>\n<ul>\n<li>University degree in Computer Science, Electrical Engineering, Engineering, or a related field, and at least 5 years of professional experience in software testing development, integration, and verification according to DO-178B/C or comparable standards in safety-critical projects.</li><li>\nIn-depth knowledge of development processes (e.g., V-Model).</li><li>\nExperience in development environment on Windows and preferably Linux operating systems.</li><li>\nProficiency in programming languages (Python, C++, C, Java, or Rust) and test automation. Experience in Test- and Requirements Management Tools like DOORS.</li><li>\nLeadership skills, structured working methods, and fluent English proficiency, ideally German.</li><li>\nWillingness to travel for project purposes and undergo a security clearance according to LuftSiG &sect;7, including obtaining a &Uuml;2 security clearance..</li>\n</ul>\n<p><b>Not a 100% match? No need to worry! Capgemini Engineering supports you with a wide range of learning opportunities so that you can develop both professionally and personally.</b></p>\n<p></p>\n<p><b>WE LOOK FORWARD TO MEETING YOU</b></p>\n<p>\nDo you have any questions about the job profile and/or requirements?<br>\nPlease get in touch with your contact person in Recruiting.<br>\n<b>Melike Ilhan, Recruiter</b> <b>Capgemini Engineering Deutschland S.A.S. &amp; Co. KG</b><br>\n+49 15203965190<br>\nmelike.ilhan@capgemini.com<br>\nPlease fill in our <b>online application form</b> completely and attach your CV, work and school certificates as well as any other relevant documents.<br>\nWe wish you every success for your application.</p><h2 class=\"jobSectionHeader\"><b><br>\nCompany Description</b></h2><p><br>\nCapgemini Engineering is a global market leader in engineering and R&amp;D services. With cutting-edge digital technologies and innovative software, we are shaping the intelligent industry of tomorrow: on the road, in the air, on the seas, in rail transport, in energy production as well as in the fields of life science, telecommunications, semiconductors, electronics and finance. We are more than 65,000 engineers and scientists in over 30 countries.\n</p><p>Capgemini Engineering is committed to the employment of a diverse workforce. Qualified applicants are considered regardless of their origin, skin colour, religion, gender, age, sexual orientation, gender identity, gender expression, veteran status or disability.</p>\n<p><b>\nGET THE FUTURE YOU WANT!</b> We look forward to hearing from you!</p><h2 class=\"jobSectionHeader\"><b><br>\nBenefits</b></h2><br>\n<ul><li>\nIndividueller Karriereplan</li><li>\nVielf&auml;ltiges Weiterbildungsangebot</li><li>\nIndustrie&uuml;bergreifender Wissenstransfer</li><li>\nE-Gym WellPass</li><li>\nNachhaltig unterwegs - Das JobRad-Programm</li><li>\nEinkaufsvorteile und Rabattaktionen</li><li>\nZahlreiche Events</li><li>\nAttraktives Mitarbeiterbeteiligungsprogramm</li><li>\nBetriebliche Altersvorsorge</li><li>\nMobiles Arbeiten nach Absprache (In- und Ausland)</li><li>\nIndividuelle Arbeits- und Teilzeitmodelle</li><li>\nWertorientierte Unternehmenskultur</li><li>\nIndividual career plan</li><li>\nDiverse range of further trainings</li><li>\nCross-industry knowledge transfer</li><li>\nE-Gym WellPass</li><li>\nSustainable on the road - the JobRad program</li><li>\nShopping advantages and discount promotions</li><li>\nNumerous events</li><li>\nAttractive employee stock ownership program</li><li>\nCompany pension plan</li><li>\nMobile work by arrangements (domestic and abroad)</li><li>\nIndividual work and part-time models</li><li>\nValue oriented corporate culture</li></ul></div>",
        "externalApplyLink": "https://de.indeed.com/applystart?jk=fdb9601756fa498a&from=vj&pos=bottom&mvj=0&jobsearchTk=1ie3ugcvegqpb872&spon=0&sjdu=YAMd6UJyGWgvrHoJpyMluoDDplm6SwWjHcxyoDIphKnZX6Yue_RoIIh5eemM2D_XeeSZGvQ4bS2kVjL7WwMJBzP5LKfDTpk7aqjEFeD9YKDhzltxZdn3uNkJuLPgz6xP24IVKU_UM2O4xDreKC9bpPV5CaKmNvVlk6XTcrt93vW6891EFjZQ49it3XSaVM_Dw9_XINGINv7OnqX9-Wv1cg&vjfrom=tp-serp&asub=mob&astse=7e4eb691427623f7&assa=4068",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "IT Support Engineer, IT Services",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "Amazon Deutschland Services GmbH",
        "location": "München",
        "rating": 3.5,
        "reviewsCount": 51294,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=eab6b2893777adc8",
        "id": "eab6b2893777adc8",
        "postedAt": "vor 3 Tagen",
        "scrapedAt": "2024-12-02T15:06:05.304Z",
        "postingDateParsed": "2024-11-28T21:57:44.000Z",
        "description": "- High school diploma or equivalent\n- Excellent customer facing skills\n- Industry technical experience in a corporate environment supporting Windows, Mac and/or Linux\n- Hands on industry experience with client, server, and network services DNS, DHCP, OSI Model and TCP/IP\n- Experience with troubleshooting in a multi-user high availability environment\n- Experience with PC repair, troubleshooting, deployment and liquidation\n\nAre you passionate about solving technical challenges and helping people? Do you thrive in a dynamic, high-impact environment? Join Amazon's IT Services team as an ITS Support Engineer and be part of the engine that powers Amazon’s seamless operations. We're seeking customer-focused, innovative problem-solvers who excel in a fast-paced, collaborative environment. As a part of our IT Services team, you'll have the opportunity to make a direct impact on Amazon's corporate global workforce, making sure their laptops, servers, and websites work seamlessly so they can build the technology that businesses worldwide rely on.\n\nAs an ITS Support Engineer, you'll be the go-to knowledge expert for Amazon's corporate employees’, providing seamless end-to-end services and frictionless on-site technical support ensuring productivity remains secure and uninterrupted. Amazon’s ITS Support Engineers are dedicated, dependable and customer focused, owning the overall IT experience. They guarantee our employees have the tools and resources they need to be successful, innovative and efficient.\n\nITS Support Engineers have an advanced understanding of IT standards, systems and equipment deployed throughout Amazon. They can work independently or collaborate with partner teams and contractors managing projects while maintaining a high level of productivity to meet goals. Quickly adapting to new processes and procedures, they act as a mentor and main partner for escalations within the team.\n\nYour day will be filled with exciting challenges and opportunities to showcase your technical expertise. You’ll engage with Amazonians across various teams, owning and recognizing their unique IT needs and provide personalized high-quality support. You'll be a trusted advisor, a problem-solver, taking initiative to diagnose, troubleshoot and resolve a wide variety of specialized hardware and software issues implementing successful solutions. Our Engineers guide and empower technical and non-technical Amazonians through the ever-evolving digital landscape implementing solutions that fit their needs.\n\nKey job responsibilities\n- Deliver on-site, high quality, hands-on support diagnosing, troubleshooting and resolving issues successfully, evaluating log files to determine the health of systems, software and hardware\n- Provide on-call support for high severity incidents and act as an escalation point of contact for team\n- Assist with activities to triage and escalate system or network outages to reduce downtime\n- Understand and execute change management activities in a high availability environment\n- Participate with partner teams and vendors on continuous improvement projects, defining requirements and managing execution to deliver operational excellence and value\n- Effectively manage and oversee IT asset inventories\n- Participate in hiring efforts, training and developing peers and new team members as a mentor, seeking and leveraging diverse perspectives in all activities\n- Continuously expand skills, learning the latest technologies and maintaining knowledge of IT policies to provide technically accurate solutions\n\nA day in the life\nIf you are not sure that every qualification on the list above describes you exactly, we’d still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skill-sets. If you’re passionate about this role and want to make an impact on a global scale, please apply!\n\nAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment.\n\nAbout the team\nOur IT Services team is a dynamic and diverse group of passionate problem-solvers who thrive on challenges and continuously push the boundaries of innovation. We foster an inclusive and collaborative environment where every voice is heard, and every idea is valued. Join us and be part of a team that truly makes a difference in the lives of Amazonians worldwide.\n\nInclusive Team Culture: Here at Amazon, it's in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n\nMentorship and Career Growth: We're continuously raising our performance bar as we strive to become Earth's Best Employer. We embrace curiosity and continuous learning, empowering you to grow both personally and professionally through mentorship, knowledge-sharing, and career-advancing resources, helping you develop into a better-rounded professional.\n\nIf you're ready to join a team of passionate problem-solvers and make a real impact, apply now to become an ITS Support Engineer at Amazon!\n\n- Bachelor’s degree in Computer Science or IT related field\n- CompTIA A+, CompTIA Network+, Cisco/CCNA, Linux (Redhat), Microsoft hardware (installation), AWS, or other industry relevant certifications\n- Experience in Active Directory and Windows Server backup solutions\n- Experience with audiovisual, video conferencing or event support\n- Ability to write simple scripts in an administrative language\n- Strong analytical skills with demonstrated problem solving abilities\n- Proven ability to develop clear, concise change management and standard operating procedure (SOP) documentation\n\nAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https://www.amazon.jobs/en/privacy_page) to know more about how we collect, use and transfer the personal data of our candidates.\n\nm/w/d",
        "descriptionHTML": "<ul>\n<li>High school diploma or equivalent</li>\n<li>Excellent customer facing skills</li>\n<li>Industry technical experience in a corporate environment supporting Windows, Mac and/or Linux</li>\n<li>Hands on industry experience with client, server, and network services DNS, DHCP, OSI Model and TCP/IP</li>\n<li>Experience with troubleshooting in a multi-user high availability environment</li>\n<li>Experience with PC repair, troubleshooting, deployment and liquidation</li>\n</ul>\nAre you passionate about solving technical challenges and helping people? Do you thrive in a dynamic, high-impact environment? Join Amazon's IT Services team as an ITS Support Engineer and be part of the engine that powers Amazon’s seamless operations. We're seeking customer-focused, innovative problem-solvers who excel in a fast-paced, collaborative environment. As a part of our IT Services team, you'll have the opportunity to make a direct impact on Amazon's corporate global workforce, making sure their laptops, servers, and websites work seamlessly so they can build the technology that businesses worldwide rely on.\n<br><br>\nAs an ITS Support Engineer, you'll be the go-to knowledge expert for Amazon's corporate employees’, providing seamless end-to-end services and frictionless on-site technical support ensuring productivity remains secure and uninterrupted. Amazon’s ITS Support Engineers are dedicated, dependable and customer focused, owning the overall IT experience. They guarantee our employees have the tools and resources they need to be successful, innovative and efficient.\n<br><br>\nITS Support Engineers have an advanced understanding of IT standards, systems and equipment deployed throughout Amazon. They can work independently or collaborate with partner teams and contractors managing projects while maintaining a high level of productivity to meet goals. Quickly adapting to new processes and procedures, they act as a mentor and main partner for escalations within the team.\n<br><br>\nYour day will be filled with exciting challenges and opportunities to showcase your technical expertise. You’ll engage with Amazonians across various teams, owning and recognizing their unique IT needs and provide personalized high-quality support. You'll be a trusted advisor, a problem-solver, taking initiative to diagnose, troubleshoot and resolve a wide variety of specialized hardware and software issues implementing successful solutions. Our Engineers guide and empower technical and non-technical Amazonians through the ever-evolving digital landscape implementing solutions that fit their needs.\n<br><br>\nKey job responsibilities\n<br><ul>\n<li>Deliver on-site, high quality, hands-on support diagnosing, troubleshooting and resolving issues successfully, evaluating log files to determine the health of systems, software and hardware</li>\n<li>Provide on-call support for high severity incidents and act as an escalation point of contact for team</li>\n<li>Assist with activities to triage and escalate system or network outages to reduce downtime</li>\n<li>Understand and execute change management activities in a high availability environment</li>\n<li>Participate with partner teams and vendors on continuous improvement projects, defining requirements and managing execution to deliver operational excellence and value</li>\n<li>Effectively manage and oversee IT asset inventories</li>\n<li>Participate in hiring efforts, training and developing peers and new team members as a mentor, seeking and leveraging diverse perspectives in all activities</li>\n<li>Continuously expand skills, learning the latest technologies and maintaining knowledge of IT policies to provide technically accurate solutions</li>\n</ul>\nA day in the life\n<br>If you are not sure that every qualification on the list above describes you exactly, we’d still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skill-sets. If you’re passionate about this role and want to make an impact on a global scale, please apply!\n<br><br>\nAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment.\n<br><br>\nAbout the team\n<br>Our IT Services team is a dynamic and diverse group of passionate problem-solvers who thrive on challenges and continuously push the boundaries of innovation. We foster an inclusive and collaborative environment where every voice is heard, and every idea is valued. Join us and be part of a team that truly makes a difference in the lives of Amazonians worldwide.\n<br><br>\n<b>Inclusive Team Culture:</b> Here at Amazon, it's in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\n<br><br>\n<b>Mentorship and Career Growth:</b> We're continuously raising our performance bar as we strive to become Earth's Best Employer. We embrace curiosity and continuous learning, empowering you to grow both personally and professionally through mentorship, knowledge-sharing, and career-advancing resources, helping you develop into a better-rounded professional.\n<br><br>\nIf you're ready to join a team of passionate problem-solvers and make a real impact, apply now to become an ITS Support Engineer at Amazon!\n<br><br>\n<ul>\n<li>Bachelor’s degree in Computer Science or IT related field</li>\n<li>CompTIA A+, CompTIA Network+, Cisco/CCNA, Linux (Redhat), Microsoft hardware (installation), AWS, or other industry relevant certifications</li>\n<li>Experience in Active Directory and Windows Server backup solutions</li>\n<li>Experience with audiovisual, video conferencing or event support</li>\n<li>Ability to write simple scripts in an administrative language</li>\n<li>Strong analytical skills with demonstrated problem solving abilities</li>\n<li>Proven ability to develop clear, concise change management and standard operating procedure (SOP) documentation</li>\n</ul>\nAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https://www.amazon.jobs/en/privacy_page) to know more about how we collect, use and transfer the personal data of our candidates.\n<br><br>\nm/w/d",
        "externalApplyLink": "https://de.indeed.com/rc/clk?jk=eab6b2893777adc8&bb=ytU0CF2loFuCjeGGlfvXKVztN2CqwidkrXkYysGKfm5prsYpKoZOodfeBI8YPcD_&xkcb=SoB967M34D1ONdW0GB1abzkdCdPP&fromas=1&xpse=SoCb67I34D1N_6yNqB0LbzkdCdPP&xfps=9879ccfc-2005-45a4-ab79-8072f66b2bb0",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "DevOps Engineer (f/m/d) - PKI Specialist",
        "salary": null,
        "jobType": [
            "Teilzeit",
            "Vollzeit"
        ],
        "company": "SAP",
        "location": "85748 Garching bei München",
        "rating": 4.2,
        "reviewsCount": 2991,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=cbf600f9bd141a4b",
        "id": "cbf600f9bd141a4b",
        "postedAt": "vor 4 Tagen",
        "scrapedAt": "2024-12-02T15:06:06.931Z",
        "postingDateParsed": "2024-11-28T00:36:43.000Z",
        "description": "We help the world run better\n\nAt SAP, we enable you to bring out your best. Our company culture is focused on collaboration and a shared passion to help the world run better. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.\n\nWhat you'll do\n\nThe PKI Operations support team is responsible for managing SAP’s mission critical, enterprise PKI environments supporting corporate and cloud infrastructure.\n\nResponsibilities:\n\nOperational experience supporting mission critical systems across multiple geographical locations and infrastructure providers\nAdvanced level troubleshooting and support of PKI system issues\nMaintain and support PKI systems within the organization\nProvide PKI consulting services to customers to understand the usage and responsibilities involved with PKI certificates\nDevelop and ensures proper PKI algorithms are enforced\nCoordinates technical incident response and remediation activities for PKI environments\nPublishes reports and maintains metrics for PKI systems\nWillingness to own multiple and varied infrastructures\nWillingness to work in different time zones if needed\nUplifting the design, implementation, and maintenance of the existing PKI and certificate management systems\nSupporting and managing digital certificates for internal and external use\nDeveloping policies and procedures for certificate management, including issuance, revocation, and renewal\nResponding to level 3 incidents and service requests\nProviding support to internal customers regarding PKI and certificate management\nConducting risk assessments and vulnerability patching to identify and mitigate potential security threats\nCollaborating with other IT teams, such as network and systems administrators, to ensure seamless integration of PKI and certificate management systems\nStaying up to date with industry trends and emerging technologies related to PKI and certificate management\nParticipate in on-call roster to ensure the security and availability of the PKI systems around the clock\nStay up to date with PKI and related trends and standards in the industry and thrive to keep the enterprise PKI environments up to date\n\nWhat you bring\n\nBachelor's degree or equivalent and 7+ years related experience with enterprise cybersecurity, PKI environments\nCISSP, CISM, SANS, or other related certifications\nStrong Windows and/or Linux Operating system support skills\nGood working knowledge of terminology used in PKI infrastructure (Certificate Authorities, Registration Authority, Certificate trust chains, OCSP and Certificate Revocation Lists)\nExperience with TLS server and client certificate and private keys management\nExperience with using HSMs (Hardware Security Modules)\nExperience with Algorithms, including RSA and AES\nExperience with Enterprise-wide Key and Secret Management\nExperience with supporting PKI systems that span multiple geographic regions and infrastructure providers\nExperience in working with hashing functions, including SHA-2/SHA-3\nFluent with the following protocols: TCP/IP, SSL, TLS, SCP and HTTPS. Understand Lightweight Directory Access Protocol (LDAP) and how it is used\nAbility to work in a global, agile and fast-paced development environment\nMastering of system integration using Webservice APIs (SOAP/Rest)\nGeneral understanding of cryptographic concepts: symmetric/asymmetric cryptography, secure hash, digital signatures, ACME protocol\nUnderstanding of REST/SOAP API, bash etc.\nExposure on popular CA solutions like Microsoft ADCS, AWS, Private CA, EJBCA and cloud PKI is a plus\nIntuitive troubleshooting skills and a knack to work also with new/unknown environments and still find a way around them\nScripting (PowerShell\\Shell\\Python) and DevOps skills\nStrong Documentation Skills and ability to write security concept documents for PKI solutions\nExcellent written and oral communication skills\nEffective and efficient time management skills\n\nBring out your best\n\nSAP innovations help more than four hundred thousand customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with two hundred million users and more than one hundred thousand employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, you can bring out your best.\n\nWe win with inclusion\n\nSAP���s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com.\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.\n\nRequisition ID: 411700 | Work Area: Software-Development Operations | Expected Travel: 0 - 10% | Career Status: Professional | Employment Type: Part Time or Regular Full Time | #LI-Hybrid",
        "descriptionHTML": "<div><p><b>We help the world run better<br>\n</b></p><p><br>\nAt SAP, we enable you to bring out your best. Our company culture is focused on collaboration and a shared passion to help the world run better. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.</p><p><br>\n</p><p><b>What you'll do</b></p><p></p><p><br>\nThe PKI Operations support team is responsible for managing SAP&rsquo;s mission critical, enterprise PKI environments supporting corporate and cloud infrastructure.</p><p></p><p><br>\nResponsibilities:</p><ul><li>\nOperational experience supporting mission critical systems across multiple geographical locations and infrastructure providers</li><li>\nAdvanced level troubleshooting and support of PKI system issues</li><li>\nMaintain and support PKI systems within the organization</li><li>\nProvide PKI consulting services to customers to understand the usage and responsibilities involved with PKI certificates</li><li>\nDevelop and ensures proper PKI algorithms are enforced</li><li>\nCoordinates technical incident response and remediation activities for PKI environments</li><li>\nPublishes reports and maintains metrics for PKI systems</li><li>\nWillingness to own multiple and varied infrastructures</li><li>\nWillingness to work in different time zones if needed</li><li>\nUplifting the design, implementation, and maintenance of the existing PKI and certificate management systems</li><li>\nSupporting and managing digital certificates for internal and external use</li><li>\nDeveloping policies and procedures for certificate management, including issuance, revocation, and renewal</li><li>\nResponding to level 3 incidents and service requests</li><li>\nProviding support to internal customers regarding PKI and certificate management</li><li>\nConducting risk assessments and vulnerability patching to identify and mitigate potential security threats</li><li>\nCollaborating with other IT teams, such as network and systems administrators, to ensure seamless integration of PKI and certificate management systems</li><li>\nStaying up to date with industry trends and emerging technologies related to PKI and certificate management</li><li>\nParticipate in on-call roster to ensure the security and availability of the PKI systems around the clock</li><li>\nStay up to date with PKI and related trends and standards in the industry and thrive to keep the enterprise PKI environments up to date</li></ul><p><b><br>\nWhat you bring</b></p><br>\n<p></p><ul><li>\nBachelor's degree or equivalent and 7+ years related experience with enterprise cybersecurity, PKI environments</li><li>\nCISSP, CISM, SANS, or other related certifications</li><li>\nStrong Windows and/or Linux Operating system support skills</li><li>\nGood working knowledge of terminology used in PKI infrastructure (Certificate Authorities, Registration Authority, Certificate trust chains, OCSP and Certificate Revocation Lists)</li><li>\nExperience with TLS server and client certificate and private keys management</li><li>\nExperience with using HSMs (Hardware Security Modules)</li><li>\nExperience with Algorithms, including RSA and AES</li><li>\nExperience with Enterprise-wide Key and Secret Management</li><li>\nExperience with supporting PKI systems that span multiple geographic regions and infrastructure providers</li><li>\nExperience in working with hashing functions, including SHA-2/SHA-3</li><li>\nFluent with the following protocols: TCP/IP, SSL, TLS, SCP and HTTPS. Understand Lightweight Directory Access Protocol (LDAP) and how it is used</li><li>\nAbility to work in a global, agile and fast-paced development environment</li><li>\nMastering of system integration using Webservice APIs (SOAP/Rest)</li><li>\nGeneral understanding of cryptographic concepts: symmetric/asymmetric cryptography, secure hash, digital signatures, ACME protocol</li><li>\nUnderstanding of REST/SOAP API, bash etc.</li><li>\nExposure on popular CA solutions like Microsoft ADCS, AWS, Private CA, EJBCA and cloud PKI is a plus</li><li>\nIntuitive troubleshooting skills and a knack to work also with new/unknown environments and still find a way around them</li><li>\nScripting (PowerShell\\Shell\\Python) and DevOps skills</li><li>\nStrong Documentation Skills and ability to write security concept documents for PKI solutions</li><li>\nExcellent written and oral communication skills</li><li>\nEffective and efficient time management skills</li></ul><p><br>\n</p><p><b>Bring out your best</b></p><p>\nSAP innovations help more than four hundred thousand customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with two hundred million users and more than one hundred thousand employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, you can bring out your best.</p><p></p><p><b><br>\nWe win with inclusion</b></p><p>\nSAP&rsquo;s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone &ndash; regardless of background &ndash; feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.<br>\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com.<br>\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.</p><p></p><p><br>\nRequisition ID: 411700 | Work Area: Software-Development Operations | Expected Travel: 0 - 10% | Career Status: Professional | Employment Type: Part Time or Regular Full Time | #LI-Hybrid</p></div><p></p>",
        "externalApplyLink": "https://de.indeed.com/applystart?jk=cbf600f9bd141a4b&from=vj&pos=bottom&mvj=0&jobsearchTk=1ie3ugenml52t88f&spon=0&sjdu=YAMd6UJyGWgvrHoJpyMluoDDplm6SwWjHcxyoDIphKkK1sUqSagFMm0sFq-k4Wmw2mxk2q9EsCNRINhY9dfeopdKNea3C-5lhnmbRcNF0L6KfoMbH5Kjzcn-svOzwQ4xLfgufwlxGdHjSBQQyN0I4vgRNrdis3509Zp8ndd9THyHVV__PR-HkzT47Q-lZAnHw9_XINGINv7OnqX9-Wv1cg&vjfrom=tp-serp&asub=mob&astse=1bfe7926f470a089&assa=5445",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Working Student GPU Software Development Engineer",
        "salary": null,
        "jobType": [],
        "company": "Advanced Micro Devices, Inc",
        "location": "München",
        "rating": 3.8,
        "reviewsCount": 633,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=c2bdb64a65052de5",
        "id": "c2bdb64a65052de5",
        "postedAt": "vor 4 Tagen",
        "scrapedAt": "2024-12-02T15:06:07.610Z",
        "postingDateParsed": "2024-11-28T00:48:08.000Z",
        "description": "Overview:\n\nWHAT YOU DO AT AMD CHANGES EVERYTHING\n\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives.\n\nAMD together we advance_\n\nResponsibilities:\n\nWORKING STUDENT (up to 20 Hr/Week )\n\nLOCATION: Munich, Germany\n\nOVERVIEW:\n\nThe Architecture and Software Technologies team at AMD is seeking a working student to join us for a one-year engagement. Our mission is to research, prototype and architect cutting-edge solutions for GPU graphics and compute. We are at the forefront of hardware and software development, focusing on fully integrated solutions that span from software to the hardware. We are looking for a motivated individual to contribute to our projects! The successful candidate will collaborate closely with AMD architects across multiple teams and play a direct role in developing future hardware and new GPU programming models.\n\nKEY RESPONSIBILITIES:\n\nSupport AMD’s R&D activities in partnership with a German university, focusing on image processing, machine learning and GPU programming models.\nContribute to the development and support of internal and external tools, infrastructure, and libraries.\nAssist in understanding and characterizing hardware behavior and performance.\n\nSPECIFIC JOB FUNCTIONS:\n\nDesign, develop, and maintain software tools and libraries.\nConduct experiments, analyze results, and document findings.\nOperate within an environment that includes code reviews and defined release processes.\nTranslate internal and external feedback into actionable feature requests and implement them.\nCommunicate findings and insights to other AMD teams and the collaborating university.\n\nSKILLS AND EXPERIENCE REQUIREMENTS:\n\nCurrently pursuing a Master's degree in computer science or related fields.\nProficiency in C/C++ programming languages.\nFamiliarity with Linux operating systems.\nExperience with software debugging tools.\nStrong verbal and written communication skills.\nSolid understanding of PC architecture.\nExperience with a modern GPU API (Direct3D 12, Vulkan, HIP/CUDA) is advantageous.\nFamiliarity with Python is a plus.\n\n#LI-HS3\n#LI-HYBRID\n\nQualifications:\n\nBenefits offered are described: AMD benefits at a glance.\n\nAMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law. We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
        "descriptionHTML": "<div>Overview:\n<div><b>\nWHAT YOU DO AT AMD CHANGES EVERYTHING</b></div>\n<div>\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences &ndash; the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world&rsquo;s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives.</div>\n<div>\nAMD together we advance_</div>\nResponsibilities:\n<div><b>\nWORKING STUDENT (up to 20 Hr/Week )</b></div><div></div><div><b><br>\nLOCATION</b>: Munich, Germany</div><div></div><div><b><br>\nOVERVIEW</b>:</div><div>\nThe Architecture and Software Technologies team at AMD is seeking a working student to join us for a one-year engagement. Our mission is to research, prototype and architect cutting-edge solutions for GPU graphics and compute. We are at the forefront of hardware and software development, focusing on fully integrated solutions that span from software to the hardware. We are looking for a motivated individual to contribute to our projects! The successful candidate will collaborate closely with AMD architects across multiple teams and play a direct role in developing future hardware and new GPU programming models.</div><div><b><br>\nKEY RESPONSIBILITIES</b>:</div><ul><li>\nSupport AMD&rsquo;s R&amp;D activities in partnership with a German university, focusing on image processing, machine learning and GPU programming models.</li><li>\nContribute to the development and support of internal and external tools, infrastructure, and libraries.</li><li>\nAssist in understanding and characterizing hardware behavior and performance.</li></ul><div><b><br>\nSPECIFIC JOB FUNCTIONS</b>:</div><ul><li>\nDesign, develop, and maintain software tools and libraries.</li><li>\nConduct experiments, analyze results, and document findings.</li><li>\nOperate within an environment that includes code reviews and defined release processes.</li><li>\nTranslate internal and external feedback into actionable feature requests and implement them.</li><li>\nCommunicate findings and insights to other AMD teams and the collaborating university.</li></ul><div><b><br>\nSKILLS AND EXPERIENCE REQUIREMENTS</b>:</div><ul><li>\nCurrently pursuing a Master's degree in computer science or related fields.</li><li>\nProficiency in <b>C/C++ programming languages</b>.</li><li>\nFamiliarity with Linux operating systems.</li><li>\nExperience with software debugging tools.</li><li>\nStrong verbal and written communication skills.</li><li>\nSolid understanding of PC architecture.</li><li>\nExperience with a modern <b>GPU API (Direct3D 12, Vulkan, HIP/CUDA) </b>is advantageous.</li><li>\nFamiliarity with Python is a plus.</li></ul><div>\n#LI-HS3<br>\n#LI-HYBRID</div>\nQualifications:\n<div><i>\nBenefits offered are described: </i>AMD benefits at a glance.</div><div></div><div><i><br>\nAMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law. We encourage applications from all qualified candidates and will accommodate applicants&rsquo; needs under the respective laws throughout all stages of the recruitment and selection process.</i></div></div>",
        "externalApplyLink": "https://de.indeed.com/rc/clk?jk=c2bdb64a65052de5&bb=-RKgaAWMmOYmmyJBcfQzDpqkL6EHyN_HB4GREmjdngpqvVoreRq7YSVirfc34iGT&xkcb=SoDW67M34D1N7N3fl50IbzkdCdPP&fromas=1&xpse=SoAf67I34D1NqDyC150LbzkdCdPP&xfps=74b52f66-857b-422c-93e5-89d7d4b19443",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Working Student Software Engineer (AI/ML)",
        "salary": null,
        "jobType": [],
        "company": "Celonis SE",
        "location": "München",
        "rating": 3.5,
        "reviewsCount": 13,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=d66492cddfd4b1e0",
        "id": "d66492cddfd4b1e0",
        "postedAt": "vor 3 Tagen",
        "scrapedAt": "2024-12-02T15:06:05.726Z",
        "postingDateParsed": "2024-11-28T20:55:25.000Z",
        "description": "We're Celonis, the global leader in Process Mining technology and one of the world's fastest-growing SaaS firms. We believe there is a massive opportunity to unlock productivity by placing data and intelligence at the core of business processes - and for that, we need you to join us.\n\nThe Team\n\nCelonis AI (CeloAI) is an organization within Celonis that is dedicated to developing AI (and broadly intelligent) technologies for Celonis products. Those technologies empower enterprises to make intelligent business decisions, and achieve operational excellence.\n\nWe are a global organization with presence in both Germany and the US. CeloAI Germany has its presence in Munich, Darmstadt, and Aachen. The role is based in Munich.\n\nThe Role\n\nAs a Working Student Software Engineer (AI/ML), you are responsible for designing, developing, testing, and maintaining:\n\nOur products, with a focus on the backend/core technology.\nML systems powering AI features of our products.\n\nYou may interact closely with the Go-to-Market organization, product managers, and software engineers to build scalable products and systems for our customers.\n\nThe work you’ll do\nTranslate business needs to technical solutions, leveraging AI when relevant.\nDesign and implement robust data collection mechanisms.\nDesign and implement APIs to serve data and algorithms at scale.\nDesign and implement scalable intelligent algorithms.\nImprove best practices in software development and DevOps.\nThe qualifications you need\nEnrolled in a Master's degree in Computer Science, or related technical field.\nExperience with software development in one or more programming languages, with data structures and algorithms.\nExperience testing, maintaining, or launching software products.\nExperience with software design and architecture.\nExperience with AI/ML techniques, and ML infrastructure.\n\nWhat Celonis Can Offer You:\n\nThe unique opportunity to work with industry-leading process mining technology\nInvestment in your personal growth and skill development (clear career paths, internal mobility opportunities, L&D platform, mentorships, and more)\nGreat compensation and benefits packages (equity (restricted stock units), life insurance, time off, generous leave for new parents from day one, and more). For intern and working student benefits, click here.\nPhysical and mental well-being support (subsidized gym membership, access to counseling, virtual events on well-being topics, and more)\nA global and growing team of Celonauts from diverse backgrounds to learn from and work with\nAn open-minded culture with innovative, autonomous teams\nBusiness Resource Groups to help you feel connected, valued and seen (Black@Celonis, Women@Celonis, Parents@Celonis, Pride@Celonis, Resilience@Celonis, and more)\nA clear set of company values that guide everything we do: Live for Customer Value, The Best Team Wins, We Own It, and Earth Is Our Future\n\nAbout Us:\n\nCelonis helps some of the world’s largest and most esteemed brands make processes work for people, companies and the planet. With over 5,000 enterprise customer deployments across nearly every industry, the Celonis Process Intelligence Platform uses process mining and AI to give you a living digital twin of your business operation. It’s system-agnostic and without bias, and empowers companies to reduce waste, create value and benefit people across the top, bottom, and green lines. Since 2011, the Celonis platform has enabled its customers to identify more than $18 billion in value. Celonis is headquartered in Munich, Germany, and New York City, USA, with more than 20 offices worldwide.\n\nGet familiar with the Celonis Process Intelligence Platform by watching this video.\n\nEqual Opportunity at Celonis:\n\nCelonis is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment and equal opportunity in all aspects of employment. We will not tolerate any unlawful discrimination or harassment of any kind. We make all employment decisions without regard to race/ethnicity, color, sex, pregnancy, age, sexual orientation, gender identity or expression, transgender status, national origin, citizenship status, religion, physical or mental disability, veteran status, or any other factor protected by applicable anti-discrimination laws. As a US federal contractor, we are committed to the principles of affirmative action in accordance with applicable laws and regulations.\n\nYour Privacy:\n\nAny information you submit to Celonis as part of your application will be processed in accordance with Celonis’\n\nPlease be aware of common job offer scams, impersonators and frauds. Learn more here.",
        "descriptionHTML": "<div></div><div><div><div><p>We're Celonis, the global leader in Process Mining technology and one of the world's fastest-growing SaaS firms. We believe there is a massive opportunity to unlock productivity by placing data and intelligence at the core of business processes - and for that, we need you to join us.</p></div>\n<p>The Team</p>\n<p>\nCelonis AI (CeloAI) is an organization within Celonis that is dedicated to developing AI (and broadly intelligent) technologies for Celonis products. Those technologies empower enterprises to make intelligent business decisions, and achieve operational excellence.</p>\n<p>\nWe are a global organization with presence in both Germany and the US. CeloAI Germany has its presence in Munich, Darmstadt, and Aachen. The role is based in Munich.</p>\n<p>\nThe Role</p>\n<p>\nAs a <b>Working Student Software Engineer (AI/ML)</b>, you are responsible for designing, developing, testing, and maintaining:</p>\n<div>\n<ul><li>Our products, with a focus on the backend/core technology.</li></ul>\n<ul><li>ML systems powering AI features of our products.</li></ul>\n</div>\n<p>You may interact closely with the Go-to-Market organization, product managers, and software engineers to build scalable products and systems for our customers.</p>\n<p>\nThe work you&rsquo;ll do</p>\n<ul><li>Translate business needs to technical solutions, leveraging AI when relevant.</li>\n<li>Design and implement robust data collection mechanisms.</li>\n<li>Design and implement APIs to serve data and algorithms at scale.</li>\n<li>Design and implement scalable intelligent algorithms.</li>\n<li>Improve best practices in software development and DevOps.</li>\n</ul><p>The qualifications you need</p>\n<ul><li>Enrolled in a Master's degree in Computer Science, or related technical field.</li>\n<li>Experience with software development in one or more programming languages, with data structures and algorithms.</li>\n<li>Experience testing, maintaining, or launching software products.</li>\n<li>Experience with software design and architecture.</li>\n<li>Experience with AI/ML techniques, and ML infrastructure.</li></ul><br>\n<p></p>\n<div><p><b>What Celonis Can Offer You:</b></p>\n<ul>\n<li>The unique opportunity to work with industry-leading process mining technology</li>\n<li>Investment in your personal growth and skill development (clear career paths, internal mobility opportunities, L&amp;D platform, mentorships, and more)</li>\n<li>Great compensation and benefits packages (equity (restricted stock units), life insurance, time off, generous leave for new parents from day one, and more). For intern and working student benefits, click here.</li>\n<li>Physical and mental well-being support (subsidized gym membership, access to counseling, virtual events on well-being topics, and more)</li>\n<li>A global and growing team of Celonauts from diverse backgrounds to learn from and work with</li>\n<li>An open-minded culture with innovative, autonomous teams</li>\n<li>Business Resource Groups to help you feel connected, valued and seen (Black@Celonis, Women@Celonis, Parents@Celonis, Pride@Celonis, Resilience@Celonis, and more)</li>\n<li>A clear set of company values that guide everything we do: Live for Customer Value, The Best Team Wins, We Own It, and Earth Is Our Future</li></ul><br>\n<p></p>\n<p><b>\nAbout Us:</b></p>\n<p>\nCelonis helps some of the world&rsquo;s largest and most esteemed brands make processes work for people, companies and the planet. With over 5,000 enterprise customer deployments across nearly every industry, the Celonis Process Intelligence Platform uses process mining and AI to give you a living digital twin of your business operation. It&rsquo;s system-agnostic and without bias, and empowers companies to reduce waste, create value and benefit people across the top, bottom, and green lines. Since 2011, the Celonis platform has enabled its customers to identify more than $18 billion in value. Celonis is headquartered in Munich, Germany, and New York City, USA, with more than 20 offices worldwide.</p>\n<p>\nGet familiar with the Celonis Process Intelligence Platform by watching this video.</p><br>\n<p></p>\n<p><b>\nEqual Opportunity at Celonis:</b></p>\n<p>\nCelonis is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment and equal opportunity in all aspects of employment. We will not tolerate any unlawful discrimination or harassment of any kind. We make all employment decisions without regard to race/ethnicity, color, sex, pregnancy, age, sexual orientation, gender identity or expression, transgender status, national origin, citizenship status, religion, physical or mental disability, veteran status, or any other factor protected by applicable anti-discrimination laws. As a US federal contractor, we are committed to the principles of affirmative action in accordance with applicable laws and regulations.</p><br>\n<p></p>\n<p><b>\nYour Privacy:</b></p>\n<p>\nAny information you submit to Celonis as part of your application will be processed in accordance with Celonis&rsquo;</p>\n<p>\nPlease be aware of common job offer scams, impersonators and frauds. Learn more here.</p></div></div></div>",
        "externalApplyLink": "https://www.celonis.com/careers/jobs/details/?jobId=6283110003",
        "searchInput": null,
        "isExpired": false
    }
]