[
    {
        "positionName": "Sr Solution Consultant- German speaking",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "ServiceNow",
        "location": "81673 München",
        "rating": 3.8,
        "reviewsCount": 274,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=5749fea7420f1210",
        "id": "5749fea7420f1210",
        "postedAt": "Gerade geschaltet",
        "scrapedAt": "2024-12-02T15:05:28.224Z",
        "postingDateParsed": "2024-12-02T12:12:41.000Z",
        "description": "Company Description\n\nIt all started in sunny San Diego, California in 2004 when a visionary engineer, Fred Luddy, saw the potential to transform how we work. Fast forward to today — ServiceNow stands as a global market leader, bringing innovative AI-enhanced technology to over 8,100 customers, including 85% of the Fortune 500®. Our intelligent cloud-based platform seamlessly connects people, systems, and processes to empower organizations to find smarter, faster, and better ways to work. But this is just the beginning of our journey. Join us as we pursue our purpose to make the world work better for everyone.\n\nJob Description\n\nAs a member of our Solution Consulting team, you will have a major impact on our future success by supporting the Employee Experience, Customer Workflow, ITX Solution Sales. You will help guide revenue for one of our products with the support and partnership of Sales, Product Management, and the executive team. This is a hands-on technical consultant who can go wide and deep on solution delivery and solution positioning during sales cycles.\n\nWhat you get to do in this role:\n\nThe Solution Consultant is a technical consultant with the advanced ability to develop, position and provide product-specific solutions during sales cycles while achieving quarterly and annual sales goals for an assigned territory.\n\nSupport product sales as a technical and domain expert of a client-facing sales team\nLead discovery workshops to determine customers' challenges and give product demonstrations to align our solution with customer needs\nAnswer product feature and technical questions from customers, channel partners and ServiceNow colleagues\nGuide strategic programs in top accounts such as customer journey sessions for roadmap and outcome agreement\nProvide feedback to product management about product enhancements that can address customer needs and guide additional value\nShare and learn best practices and re-usable assets with other Solution Consultants to enhance the quality and efficiency of the team\nStay current on competitive analysis and market differentiation\nSupport marketing events including executive briefings, conferences, user groups, and trade shows\n\nQualifications\n\nTo be successful in this role you have:\n\n5+ years of pre-sales solution consulting or sales engineering experience\nProficiency with the ServiceNow platform or technical expertise with cloud software solutions\nExperience working collaboratively with product management, product marketing, partners, and professional services\nTerritory management skills, including pipeline building and working with Sales counterpart to promote execution excellence\nWillingness to travel\n\nFD21\n\nNot sure if you meet every qualification? We still encourage you to apply! We value inclusivity, welcoming candidates from diverse backgrounds, including non-traditional paths. Unique experiences enrich our team, and the willingness to dream big makes you an exceptional candidate!\n\nAdditional Information\n\nWork Personas\n\nWe approach our distributed world of work with flexibility and trust. Work personas (flexible, remote, or required in office) are categories that are assigned to ServiceNow employees depending on the nature of their work. Learn more here.\n\nEqual Opportunity Employer\n\nServiceNow is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status, or any other category protected by law. In addition, all qualified applicants with arrest or conviction records will be considered for employment in accordance with legal requirements.\n\nAccommodations\n\nWe strive to create an accessible and inclusive experience for all candidates. If you require a reasonable accommodation to complete any part of the application process, or are unable to use this online application and need an alternative method to apply, please contact globaltalentss@servicenow.com for assistance.\n\nExport Control Regulations\n\nFor positions requiring access to controlled technology subject to export control regulations, including the U.S. Export Administration Regulations (EAR), ServiceNow may be required to obtain export control approval from government authorities for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by relevant export control authorities.\n\nFrom Fortune. ©2024 Fortune Media IP Limited. All rights reserved. Used under license.",
        "descriptionHTML": "<div><b>Company Description</b><p><br>\nIt all started in sunny San Diego, California in 2004 when a visionary engineer, Fred Luddy, saw the potential to transform how we work. Fast forward to today &mdash; ServiceNow stands as a global market leader, bringing innovative AI-enhanced technology to over 8,100 customers, including 85% of the Fortune 500&reg;. Our intelligent cloud-based platform seamlessly connects people, systems, and processes to empower organizations to find smarter, faster, and better ways to work. But this is just the beginning of our journey. Join us as we pursue our purpose to make the world work better for everyone.</p><b><br>\nJob Description</b><p><br>\nAs a member of our Solution Consulting team, you will have a major impact on our future success by supporting the Employee Experience, Customer Workflow, ITX Solution Sales. You will help guide revenue for one of our products with the support and partnership of Sales, Product Management, and the executive team. This is a hands-on technical consultant who can go wide and deep on solution delivery and solution positioning during sales cycles.</p>\n<p><b>What you get to do in this role:</b></p>\n<p>The Solution Consultant is a technical consultant with the advanced ability to develop, position and provide product-specific solutions during sales cycles while achieving quarterly and annual sales goals for an assigned territory.</p>\n<ul><li>Support product sales as a technical and domain expert of a client-facing sales team</li>\n<li>Lead discovery workshops to determine customers' challenges and give product demonstrations to align our solution with customer needs</li>\n<li>Answer product feature and technical questions from customers, channel partners and ServiceNow colleagues</li>\n<li>Guide strategic programs in top accounts such as customer journey sessions for roadmap and outcome agreement</li>\n<li>Provide feedback to product management about product enhancements that can address customer needs and guide additional value</li>\n<li>Share and learn best practices and re-usable assets with other Solution Consultants to enhance the quality and efficiency of the team</li>\n<li>Stay current on competitive analysis and market differentiation</li>\n<li>Support marketing events including executive briefings, conferences, user groups, and trade shows</li><br>\n</ul><br>\n<br>\n<b>Qualifications</b><p><b><br>\nTo be successful in this role you have:</b></p>\n<ul><li>5+ years of pre-sales solution consulting or sales engineering experience</li>\n<li>Proficiency with the ServiceNow platform or technical expertise with cloud software solutions</li>\n<li>Experience working collaboratively with product management, product marketing, partners, and professional services</li>\n<li>Territory management skills, including pipeline building and working with Sales counterpart to promote execution excellence</li>\n<li>Willingness to travel</li></ul><br>\n<p></p><p>FD21</p><p><i>\nNot sure if you meet every qualification? We still encourage you to apply! We value inclusivity, welcoming candidates from diverse backgrounds, including non-traditional paths. Unique experiences enrich our team, and the willingness to dream big makes you an exceptional candidate!</i></p><b><br>\nAdditional Information</b><p><b><br>\nWork Personas</b></p>\n<p>We approach our distributed world of work with flexibility and trust. Work personas (flexible, remote, or required in office) are categories that are assigned to ServiceNow employees depending on the nature of their work. Learn more here.</p>\n<p><b>Equal Opportunity Employer</b></p>\n<p>ServiceNow is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status, or any other category protected by law. In addition, all qualified applicants with arrest or conviction records will be considered for employment in accordance with legal requirements.</p>\n<p><b>Accommodations</b></p>\n<p>We strive to create an accessible and inclusive experience for all candidates. If you require a reasonable accommodation to complete any part of the application process, or are unable to use this online application and need an alternative method to apply, please contact globaltalentss@servicenow.com for assistance.</p>\n<p><b>Export Control Regulations</b></p>\n<p>For positions requiring access to controlled technology subject to export control regulations, including the U.S. Export Administration Regulations (EAR), ServiceNow may be required to obtain export control approval from government authorities for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by relevant export control authorities.</p>\n<p>From Fortune. &copy;2024 Fortune Media IP Limited. All rights reserved. Used under license.</p></div>",
        "externalApplyLink": null,
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Senior Solution Engineer DACH",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "Atlassian",
        "location": "München",
        "rating": 3.9,
        "reviewsCount": 51,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=af20862a65269c2a",
        "id": "af20862a65269c2a",
        "postedAt": "vor 1 Tag",
        "scrapedAt": "2024-12-02T15:05:27.691Z",
        "postingDateParsed": "2024-12-01T09:06:58.000Z",
        "description": "Overview:\n\nWorking at Atlassian\n\nAtlassians can choose where they work – whether in an office, from home, or a combination of the two. That way, Atlassians have more control over supporting their family, personal goals, and other priorities. We can hire people in any country where we have a legal entity. Interviews and onboarding are conducted virtually, a part of being a distributed-first company.\n\nResponsibilities:\n\nOverview\n\nAtlassian is looking for a Pre-Sales Solutions Engineer for our German market within our enterprise business who’s passionate about being a product expert in the sales cycle, solving our enterprise customer’s hardest business problems with our products and solutions, and helping close our enterprise deals. Interested? Read on!\n\nResponsibilities\n\nIn This Job, You Will:\n\npartner with direct sales, partners and larger account teams on Fortune 500 customers, tracking the overall customer profile, business problems and complexities, roadmaps, and solution success to optimize the customers within your account team territory\n\nparticipate in customer discovery to understand the customer's current state, what business problems they want to solve, and map back to the Atlassian products, platforms and solutions that will get them where they want to be\n\nprobe for and identify additional opportunities for cross-product/solution expansion\n\ninvestigate, discover, and assess client pain points\n\nBe a product expert of Atlassian software in the pre-sales process, articulating and showing the customer the value of the software and how it can change their way of working\n\nhave a broad understanding of full Atlassian product and solution offerings and paint a compelling story of how they work together to unlock the power of teams\n\nLead compelling value-based demonstrations, both standard and customized, flexing across multiple different stakeholder needs, from deep individual product demos to selling the large vision of the whole portfolio\n\nUnderstand, lead, and guide the customer's technical needs in the sales process to gain buy-in from the customer on Atlassian being the right decision\n\nProactively forge strong partnerships with aligned account executives, regularly discussing pipeline, current and upcoming opportunities and needs, bi-directional feedback, and ways to improve the selling cycle together\n\nUnderstand, track and document product feedback and competitive intelligence from customers and advocate for the development internally by documenting and sharing with product management\n\nContinuously learn, develop and refine your pre-sales and product, solution and platform offering knowledge and sales processes and Atlassian products progress\n\nQualifications\n\nAbout You:\n\nWe’re looking for a dynamic team member with a go-getter attitude who will both learn from and teach our passionate and growing organization.\n\nOn paper, you have 5+ years of experience interacting with enterprise customers in a pre-sales capacity, with excellent communication, strong presentation skills to multi-level audiences, and unmatched agility to do what it takes to get the job done. If you’re looking to be a cog in the system, this job isn’t for you. You’ve got a customer-centric mindset, with a proven track record in building executive relationships with customers and rally the internal teams to collaborate across the company to meet our customers needs.\n\nYou’re a creative problem solver who can interpret complex business problems, boil them down into solutions, and collaborate with prospects, partners, and the Atlassian sales team to deliver compelling value-based solutions. You’re equally comfortable in both a business and technical context, interacting with executives or talking shop with strong technical audiences. You love to learn and continuously grow and challenge yourself, are open to giving and receiving feedback, tolerate failure, love to win, hate to lose, and are passionate about making customers and Atlassian successful.\n\nYou’re fluent in German and English.\n\nMore about our team\n\nYou’ll be working alongside a globally distributed SE team, speaking with Global 2000 companies every day, and collaborating closely with our sales teams to provide an enterprise experience to our customers. We're a get s#!% done distributed team, built on Atlassian's core values. If this sounds like how you want to work, then we’re excited at the opportunity to have you join the team and help our company grow and change for the better.\n\nOur perks & benefits\n\nAtlassian offers a variety of perks and benefits to support you, your family and to help you engage with your local community. Our offerings include health coverage, paid volunteer days, wellness resources, and so much more. Visit go.atlassian.com/perksandbenefits to learn more.\n\nWorking at Atlassian\n\nAtlassians can choose where they work – whether in an office, from home, or a combination of the two. That way, Atlassians have more control over supporting their family, personal goals, and other priorities. We can hire people in any country where we have a legal entity. Interviews and onboarding are conducted virtually, a part of being a distributed-first company.\n\nAbout Atlassian\n\nAt Atlassian, we're motivated by a common goal: to unleash the potential of every team. Our software products help teams all over the planet and our solutions are designed for all types of work. Team collaboration through our tools makes what may be impossible alone, possible together.\n\nWe believe that the unique contributions of all Atlassians create our success. To ensure that our products and culture continue to incorporate everyone's perspectives and experience, we never discriminate based on race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status. All your information will be kept confidential according to EEO guidelines.\n\nTo provide you the best experience, we can support with accommodations or adjustments at any stage of the recruitment process. Simply inform our Recruitment team during your conversation with them.\n\nTo learn more about our culture and hiring process, visit go.atlassian.com/crh.\n\nQualifications:\n\nOur perks & benefits\n\nAtlassian offers a variety of perks and benefits to support you, your family and to help you engage with your local community. Our offerings include health coverage, paid volunteer days, wellness resources, and so much more. Visit go.atlassian.com/perksandbenefits to learn more.\n\nAbout Atlassian\n\nAt Atlassian, we're motivated by a common goal: to unleash the potential of every team. Our software products help teams all over the planet and our solutions are designed for all types of work. Team collaboration through our tools makes what may be impossible alone, possible together.\n\nWe believe that the unique contributions of all Atlassians create our success. To ensure that our products and culture continue to incorporate everyone's perspectives and experience, we never discriminate based on race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status. All your information will be kept confidential according to EEO guidelines.\n\nTo provide you the best experience, we can support with accommodations or adjustments at any stage of the recruitment process. Simply inform our Recruitment team during your conversation with them.\n\nTo learn more about our culture and hiring process, visit go.atlassian.com/crh.",
        "descriptionHTML": "<div>Overview:\n<p><b>\nWorking at Atlassian</b></p><p>\nAtlassians can choose where they work &ndash; whether in an office, from home, or a combination of the two. That way, Atlassians have more control over supporting their family, personal goals, and other priorities. We can hire people in any country where we have a legal entity. Interviews and onboarding are conducted virtually, a part of being a distributed-first company.</p><p></p>\nResponsibilities:\n<p><b>\nOverview</b></p><p>\nAtlassian is looking for a Pre-Sales Solutions Engineer for our German market within our enterprise business who&rsquo;s passionate about being a product expert in the sales cycle, solving our enterprise customer&rsquo;s hardest business problems with our products and solutions, and helping close our enterprise deals. Interested? Read on!</p><p></p><p><b>\nResponsibilities</b></p><h4 class=\"jobSectionHeader\"><b>\nIn This Job, You Will:</b></h4><ul><li><p>\npartner with direct sales, partners and larger account teams on Fortune 500 customers, tracking the overall customer profile, business problems and complexities, roadmaps, and solution success to optimize the customers within your account team territory</p></li><li><p>\nparticipate in customer discovery to understand the customer's current state, what business problems they want to solve, and map back to the Atlassian products, platforms and solutions that will get them where they want to be</p></li><li><p>\nprobe for and identify additional opportunities for cross-product/solution expansion</p></li><li><p>\ninvestigate, discover, and assess client pain points</p></li></ul><ul><li><p>\nBe a product expert of Atlassian software in the pre-sales process, articulating and showing the customer the value of the software and how it can change their way of working</p></li><li><p>\nhave a broad understanding of full Atlassian product and solution offerings and paint a compelling story of how they work together to unlock the power of teams</p></li><li><p>\nLead compelling value-based demonstrations, both standard and customized, flexing across multiple different stakeholder needs, from deep individual product demos to selling the large vision of the whole portfolio</p></li><li><p>\nUnderstand, lead, and guide the customer's technical needs in the sales process to gain buy-in from the customer on Atlassian being the right decision</p></li></ul><ul><li><p>\nProactively forge strong partnerships with aligned account executives, regularly discussing pipeline, current and upcoming opportunities and needs, bi-directional feedback, and ways to improve the selling cycle together</p></li><li><p>\nUnderstand, track and document product feedback and competitive intelligence from customers and advocate for the development internally by documenting and sharing with product management</p></li><li><p>\nContinuously learn, develop and refine your pre-sales and product, solution and platform offering knowledge and sales processes and Atlassian products progress</p></li></ul><p></p><p><b>\nQualifications</b></p><h4 class=\"jobSectionHeader\"><b>\nAbout You:</b></h4><p>\nWe&rsquo;re looking for a dynamic team member with a go-getter attitude who will both learn from and teach our passionate and growing organization.</p><p>\nOn paper, you have 5+ years of experience interacting with enterprise customers in a pre-sales capacity, with excellent communication, strong presentation skills to multi-level audiences, and unmatched agility to do what it takes to get the job done. If you&rsquo;re looking to be a cog in the system, this job isn&rsquo;t for you. You&rsquo;ve got a customer-centric mindset, with a proven track record in building executive relationships with customers and rally the internal teams to collaborate across the company to meet our customers needs.</p><p>\nYou&rsquo;re a creative problem solver who can interpret complex business problems, boil them down into solutions, and collaborate with prospects, partners, and the Atlassian sales team to deliver compelling value-based solutions. You&rsquo;re equally comfortable in both a business and technical context, interacting with executives or talking shop with strong technical audiences. You love to learn and continuously grow and challenge yourself, are open to giving and receiving feedback, tolerate failure, love to win, hate to lose, and are passionate about making customers and Atlassian successful.</p><p>\nYou&rsquo;re fluent in <b>German and English</b>.</p><h4 class=\"jobSectionHeader\"><b>\nMore about our team</b></h4><p>\nYou&rsquo;ll be working alongside a globally distributed SE team, speaking with Global 2000 companies every day, and collaborating closely with our sales teams to provide an enterprise experience to our customers. We're a get s#!% done distributed team, built on Atlassian's core values. If this sounds like how you want to work, then we&rsquo;re excited at the opportunity to have you join the team and help our company grow and change for the better.</p><p><b>\nOur perks &amp; benefits</b></p><p>\nAtlassian offers a variety of perks and benefits to support you, your family and to help you engage with your local community. Our offerings include health coverage, paid volunteer days, wellness resources, and so much more. Visit <b>go.atlassian.com/perksandbenefits</b><b> </b>to learn more.</p><p><b>\nWorking at Atlassian</b></p><p>\nAtlassians can choose where they work &ndash; whether in an office, from home, or a combination of the two. That way, Atlassians have more control over supporting their family, personal goals, and other priorities. We can hire people in any country where we have a legal entity. Interviews and onboarding are conducted virtually, a part of being a distributed-first company.</p><p><b>\nAbout Atlassian</b></p><p>\nAt Atlassian, we're motivated by a common goal: to unleash the potential of every team. Our software products help teams all over the planet and our solutions are designed for all types of work. Team collaboration through our tools makes what may be impossible alone, possible together.</p><p>\nWe believe that the unique contributions of all Atlassians create our success. To ensure that our products and culture continue to incorporate everyone's perspectives and experience, we never discriminate based on race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status. All your information will be kept confidential according to EEO guidelines.</p><p>\nTo provide you the best experience, we can support with accommodations or adjustments at any stage of the recruitment process. Simply inform our Recruitment team during your conversation with them.</p><p>\nTo learn more about our culture and hiring process, visit <b>go.atlassian.com/crh</b><b>.</b></p>\nQualifications:\n<p></p><p><b>\nOur perks &amp; benefits</b></p><p>\nAtlassian offers a variety of perks and benefits to support you, your family and to help you engage with your local community. Our offerings include health coverage, paid volunteer days, wellness resources, and so much more. Visit <b>go.atlassian.com/perksandbenefits</b><b> </b>to learn more.</p><p><b>\nAbout Atlassian</b></p><p>\nAt Atlassian, we're motivated by a common goal: to unleash the potential of every team. Our software products help teams all over the planet and our solutions are designed for all types of work. Team collaboration through our tools makes what may be impossible alone, possible together.</p><p>\nWe believe that the unique contributions of all Atlassians create our success. To ensure that our products and culture continue to incorporate everyone's perspectives and experience, we never discriminate based on race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status. All your information will be kept confidential according to EEO guidelines.</p><p>\nTo provide you the best experience, we can support with accommodations or adjustments at any stage of the recruitment process. Simply inform our Recruitment team during your conversation with them.</p><p>\nTo learn more about our culture and hiring process, visit <b>go.atlassian.com/crh</b><b>.</b></p></div>",
        "externalApplyLink": "https://de.indeed.com/applystart?jk=af20862a65269c2a&from=vj&pos=bottom&mvj=0&jobsearchTk=1ie3uf964l6i785p&spon=0&sjdu=YAMd6UJyGWgvrHoJpyMluoDDplm6SwWjHcxyoDIphKnbcw70J1jgFv7hTux9Tt7ZqNsfRg0NLo3IADFvkR2lrp0XNVDlsQDGz8Z1dqXpK2Zv24kHwnxLQx9Jfu2qqNPQnQctZf2AL2-Rn9V2ZXc353ZSKCSwX3Kuj4kP4dAJJjb3EO2r1AWxeRfJ3lXPWCfSw9_XINGINv7OnqX9-Wv1cg&vjfrom=tp-serp&asub=mob&astse=41c033db9ce79370&assa=6876",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "IT Systems Engineer - Network Services",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "Brainlab",
        "location": "München",
        "rating": 3.7,
        "reviewsCount": 59,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=4c9ced9da237324b",
        "id": "4c9ced9da237324b",
        "postedAt": "Gerade geschaltet",
        "scrapedAt": "2024-12-02T15:05:31.927Z",
        "postingDateParsed": "2024-12-02T07:03:57.000Z",
        "description": "Company Description\n\nFounded in Munich, Germany in 1989, Brainlab develops, manufactures and markets software-driven medical technology, enabling access to improved, more efficient, less-invasive patient treatments. Our key to success is our creative, talented and hard-working team, which consists of around 2400 dedicated and inspiring individuals in 25 locations worldwide. To succeed in reaching our targets, we are seeking committed colleagues who can stand behind our core values curious, authentic and useful.\n\nJob Description\n\nAs a IT System Engineer, you will be a key contributor to the management, optimization, and enhancement of our IT infrastructure, utilizing core technologies such as firewalls, Zero Trust Network Access (ZTNA) principles, DDI solutions, load balancing, and Public Key Infrastructure (PKI).\n\nYou will take ownership of designing, implementing, and maintaining these critical network and security systems, ensuring seamless operations, optimal performance, and comprehensive security.\nThis role demands deep technical expertise in firewall management, network load balancing, and DDI (DNS, DHCP, IP Address Management) solutions, along with a solid understanding of ZTNA principles to enforce Zero Trust policies across our environment. You will collaborate closely with cross-functional teams, playing an active role in developing, deploying, and optimizing technologies to ensure a secure, scalable, and highly resilient IT landscape.\n\nKey Responsibilities:\n\nManage and optimize firewalls and Web Application Firewall (WAF) solutions to protect against threats and enhance network performance.\nImplement and support Secure Access Service Edge (SASE) solutions.\nApply Zero Trust Network Access (ZTNA) principles to enhance secure access to resources.\nAdminister and maintain Microsoft PKI (Public Key Infrastructure) environments.\nOversee public certificate lifecycles and manage certificate systems.\nOptimize and support load balancing solutions for high availability and performance.\nDesign and troubleshoot network architectures, ensuring robust operations and security compliance.\nManage and architect DNS, DHCP, and IP Address Management (DDI) solutions for scalable network operations.\nAdminister proxies to ensure secure and efficient content delivery and access.\nImplement automation processes to improve efficiency and operational consistency.\nDrive continuous improvements across all areas of responsibility, enhancing scalability, performance, and maintainability.\nDevelop and refine technical documentation, processes, and standards to align with best practices.\n\nQualifications\n\nDegree in Computer Science, Information Technology, or a related field, or equivalent work experience (3+ years in IT systems engineering or similar roles).\nHands-on experience with firewalls, WAFs, SASE, and Zero Trust Architecture (ZTA) principles.\nExpertise in Microsoft PKI, certificate management systems, and public certificate processes.\nSolid understanding of network protocols, architecture, and troubleshooting.\nExperience managing load balancing technologies, proxies, and DDI architecture.\nFamiliarity with automation tools and scripting for system management and optimization.\nStrong analytical and problem-solving skills to address complex technical challenges.\nAbility to identify areas for operational improvement and successfully drive enhancements.\nExcellent communication skills, capable of conveying technical information to both technical and non-technical stakeholders.\nAdvanced proficiency in English, with additional proficiency in German considered a plus.\nPreferred certifications: CCNP, CCSA, CCSE, CISSP, or similar networking, security, or system engineering qualifications.\n\nAdditional Information\n\nA mutually-supportive, international team\nMeaningful work with a lasting impact on medical technology\n30 vacation days, plus December 24th and December 31st\nFlexible working hours as well as hybrid work model within Germany\nBike leasing via cooperation partner \"BikeLeasing\"\nParking garage and safe underground bike storage\nAward-winning subsidized company restaurant and in-house cafes\nVariety-rich fitness program in our ultra-modern 360m2 company gym\nRegular after work, team, and company events\nComprehensive training and continuing education opportunities\n\nReady to apply? We look forward to receiving your online application including your first available start date and desired salary.\n\nContact person: Daniel Sypli",
        "descriptionHTML": "<div><b>Company Description</b><p><br>\nFounded in Munich, Germany in 1989, Brainlab develops, manufactures and markets software-driven medical technology, enabling access to improved, more efficient, less-invasive patient treatments. Our key to success is our creative, talented and hard-working team, which consists of around 2400 dedicated and inspiring individuals in 25 locations worldwide. To succeed in reaching our targets, we are seeking committed colleagues who can stand behind our core values curious, authentic and useful.</p><b><br>\nJob Description</b><p><br>\nAs a IT System Engineer, you will be a key contributor to the management, optimization, and enhancement of our IT infrastructure, utilizing core technologies such as firewalls, Zero Trust Network Access (ZTNA) principles, DDI solutions, load balancing, and Public Key Infrastructure (PKI).</p><p>\nYou will take ownership of designing, implementing, and maintaining these critical network and security systems, ensuring seamless operations, optimal performance, and comprehensive security.<br>\nThis role demands deep technical expertise in firewall management, network load balancing, and DDI (DNS, DHCP, IP Address Management) solutions, along with a solid understanding of ZTNA principles to enforce Zero Trust policies across our environment. You will collaborate closely with cross-functional teams, playing an active role in developing, deploying, and optimizing technologies to ensure a secure, scalable, and highly resilient IT landscape.</p><p><br>\nKey Responsibilities:</p><ul><li>\nManage and optimize firewalls and Web Application Firewall (WAF) solutions to protect against threats and enhance network performance.</li><li>\nImplement and support Secure Access Service Edge (SASE) solutions.</li><li>\nApply Zero Trust Network Access (ZTNA) principles to enhance secure access to resources.</li><li>\nAdminister and maintain Microsoft PKI (Public Key Infrastructure) environments.</li><li>\nOversee public certificate lifecycles and manage certificate systems.</li><li>\nOptimize and support load balancing solutions for high availability and performance.</li><li>\nDesign and troubleshoot network architectures, ensuring robust operations and security compliance.</li><li>\nManage and architect DNS, DHCP, and IP Address Management (DDI) solutions for scalable network operations.</li><li>\nAdminister proxies to ensure secure and efficient content delivery and access.</li><li>\nImplement automation processes to improve efficiency and operational consistency.</li><li>\nDrive continuous improvements across all areas of responsibility, enhancing scalability, performance, and maintainability.</li><li>\nDevelop and refine technical documentation, processes, and standards to align with best practices.</li></ul><br>\n<b>\nQualifications</b><br>\n<ul><li>\nDegree in Computer Science, Information Technology, or a related field, or equivalent work experience (3+ years in IT systems engineering or similar roles).</li><li>\nHands-on experience with firewalls, WAFs, SASE, and Zero Trust Architecture (ZTA) principles.</li><li>\nExpertise in Microsoft PKI, certificate management systems, and public certificate processes.</li><li>\nSolid understanding of network protocols, architecture, and troubleshooting.</li><li>\nExperience managing load balancing technologies, proxies, and DDI architecture.</li><li>\nFamiliarity with automation tools and scripting for system management and optimization.</li><li>\nStrong analytical and problem-solving skills to address complex technical challenges.</li><li>\nAbility to identify areas for operational improvement and successfully drive enhancements.</li><li>\nExcellent communication skills, capable of conveying technical information to both technical and non-technical stakeholders.</li><li>\nAdvanced proficiency in English, with additional proficiency in German considered a plus.</li><li>\nPreferred certifications: CCNP, CCSA, CCSE, CISSP, or similar networking, security, or system engineering qualifications.</li></ul><br>\n<b>\nAdditional Information</b><br>\n<ul><li>\nA mutually-supportive, international team</li><li>\nMeaningful work with a lasting impact on medical technology</li><li>\n30 vacation days, plus December 24th and December 31st</li><li>\nFlexible working hours as well as hybrid work model within Germany</li><li>\nBike leasing via cooperation partner &quot;BikeLeasing&quot;</li><li>\nParking garage and safe underground bike storage</li><li>\nAward-winning subsidized company restaurant and in-house cafes</li><li>\nVariety-rich fitness program in our ultra-modern 360m2 company gym</li><li>\nRegular after work, team, and company events</li><li>\nComprehensive training and continuing education opportunities</li></ul><p>\nReady to apply? We look forward to receiving your online application including your first available start date and desired salary.</p><p>\nContact person: Daniel Sypli</p></div>",
        "externalApplyLink": null,
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Systems Development Engineer",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "Google",
        "location": "München",
        "rating": 4.3,
        "reviewsCount": 5753,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=626f65b3d9fd1910",
        "id": "626f65b3d9fd1910",
        "postedAt": "vor 2 Tagen",
        "scrapedAt": "2024-12-02T15:05:30.719Z",
        "postingDateParsed": "2024-11-29T20:17:57.000Z",
        "description": "Minimum qualifications:\n\n• Bachelor's degree in Computer Science, IT-related field, or equivalent practical experience.\n• 3 years of experience with TCP/IP and networking concepts (e.g., PXE boot, Subnets, VLANs, Jumbo Frames, LACP, NIC Teaming, Unicast/Broadcast/Multicast, ACLs, DNS, etc.).\n• 3 years of experience with systems automation, systems design and implementation.\n• Experience in scripting (e.g., Bash, Perl, Python, Ruby, etc.) and in one of the following infrastructures (e.g., Linux, Kubernetes, Networking, Storage, etc.).\n• Due to the sensitive nature of this role, candidates must be able to obtain and maintain a Level 2 security clearance (SÜ2) under the German Classification Act (SÜG)\n\nPreferred qualifications:\n\n• Experience in Site Reliability Engineer (SRE) or IT production systems engineering.\n• Experience with product testing or beta testing programs.\n• Knowledge of physical server, storage, and network devices.\n• Ability to travel internationally up to 25% of the time as needed.\n• Excellent relationship-building, communication, and presentation skills, with the ability to empathize with customers and understand their needs.\n• Excellent investigative and problem-solving skills, with a passion for technology and delivering high-quality user experiences.\n\nAbout the job\n\nSystems Development Engineering (SDE) at Google is a role where you manage services and systems at scale. SDEs creatively put their engineering discipline to use automating the mundane and reducing toil. We don’t just write code to fix bugs, but emphasize the development of tools and solutions that fix classes of problems. We know it’s hard to control what you can’t measure – so we focus on observability: instrumenting first, then turning data into knowledge, and finally knowledge into action. We know that the operational efficiency of Google systems, services, virtual compute environments and the operating systems that power them impact the environment, not just the bottom line. We know that working together we can do more, and that community matters.Google brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow.Together we engineer and build the infrastructure, tools, access and telemetry for systems that enable orchestration of Google-scale services. Come build things that matter.\nGoogle Distributed Cloud Hosted (GDCH) is a private cloud offering. It includes everything to launch a cloud offering, including software, hardware, tools, operating process, runbooks, and training.In this role, you will be responsible for deploying GDCH solutions at customer sites and internal reference deployments, you will also build knowledge in utilizing and operating Google Distributed Cloud Hosted solutions.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\n\n• Manage GDCH using our public documentation and gain experience with the same resources customers use, identify and report product bugs, usability issues, and other issues before they impact customers.\n• Determine the appropriate course of action when bugs or usability issues are identified.\n• Collect, document, and analyze feedback and communicate findings to development teams, provide insights for product improvement, build and monitor key metrics, identify trends, and report on the impact of internal activations and operations.\n• Perform day-to-day troubleshooting and resolution of Infrastructure issues.\n• Participate in Customer, Partner, and Internal team activations and training and in the 24x7 on-call rotation to support escalations from client inquiries as well as internal reference inquiries.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See alsoGoogle's EEO Policy andEEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing ourAccommodations for Applicants form.",
        "descriptionHTML": "<b>Minimum qualifications:</b><br>\n<ul>\n<li>Bachelor's degree in Computer Science, IT-related field, or equivalent practical experience.</li>\n<li>3 years of experience with TCP/IP and networking concepts (e.g., PXE boot, Subnets, VLANs, Jumbo Frames, LACP, NIC Teaming, Unicast/Broadcast/Multicast, ACLs, DNS, etc.).</li>\n<li>3 years of experience with systems automation, systems design and implementation.</li>\n<li>Experience in scripting (e.g., Bash, Perl, Python, Ruby, etc.) and in one of the following infrastructures (e.g., Linux, Kubernetes, Networking, Storage, etc.).</li>\n<li>Due to the sensitive nature of this role, candidates must be able to obtain and maintain a Level 2 security clearance (SÜ2) under the German Classification Act (SÜG)</li>\n</ul>\n<b>Preferred qualifications:</b><br>\n<ul>\n<li>Experience in Site Reliability Engineer (SRE) or IT production systems engineering.</li>\n<li>Experience with product testing or beta testing programs.</li>\n<li>Knowledge of physical server, storage, and network devices.</li>\n<li>Ability to travel internationally up to 25% of the time as needed.</li>\n<li>Excellent relationship-building, communication, and presentation skills, with the ability to empathize with customers and understand their needs.</li>\n<li>Excellent investigative and problem-solving skills, with a passion for technology and delivering high-quality user experiences.</li>\n</ul>\nAbout the job\n<br><br>\nSystems Development Engineering (SDE) at Google is a role where you manage services and systems at scale. SDEs creatively put their engineering discipline to use automating the mundane and reducing toil. We don’t just write code to fix bugs, but emphasize the development of tools and solutions that fix classes of problems. We know it’s hard to control what you can’t measure – so we focus on observability: instrumenting first, then turning data into knowledge, and finally knowledge into action. We know that the operational efficiency of Google systems, services, virtual compute environments and the operating systems that power them impact the environment, not just the bottom line. We know that working together we can do more, and that community matters.Google brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow.Together we engineer and build the infrastructure, tools, access and telemetry for systems that enable orchestration of Google-scale services. Come build things that matter.\n<br>Google Distributed Cloud Hosted (GDCH) is a private cloud offering. It includes everything to launch a cloud offering, including software, hardware, tools, operating process, runbooks, and training.In this role, you will be responsible for deploying GDCH solutions at customer sites and internal reference deployments, you will also build knowledge in utilizing and operating Google Distributed Cloud Hosted solutions.\n<br>Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n<br><br>\nResponsibilities\n<br><br>\n<ul>\n<li>Manage GDCH using our public documentation and gain experience with the same resources customers use, identify and report product bugs, usability issues, and other issues before they impact customers.</li>\n<li>Determine the appropriate course of action when bugs or usability issues are identified.</li>\n<li>Collect, document, and analyze feedback and communicate findings to development teams, provide insights for product improvement, build and monitor key metrics, identify trends, and report on the impact of internal activations and operations.</li>\n<li>Perform day-to-day troubleshooting and resolution of Infrastructure issues.</li>\n<li>Participate in Customer, Partner, and Internal team activations and training and in the 24x7 on-call rotation to support escalations from client inquiries as well as internal reference inquiries.</li>\n</ul>\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See alsoGoogle's EEO Policy andEEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing ourAccommodations for Applicants form.",
        "externalApplyLink": "https://de.indeed.com/rc/clk?jk=626f65b3d9fd1910&bb=Ur9IwKPGP7xjE1kcfBEhxkclFruIlZhe_K3i3HfsYdm8S4QKwU9yas8QSkGsR2v4&xkcb=SoCM67M34D0yavyMQB0LbzkdCdPP&fromas=1&xpse=SoDg67I34D0yN_yNqB0LbzkdCdPP&xfps=54d842ba-65fd-42b1-a355-722d5de4aaf1",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Software Engineer (Golang)",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "Diabolocom",
        "location": "München",
        "rating": 4.7,
        "reviewsCount": 3,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=4a862cd5dd1ccdbc",
        "id": "4a862cd5dd1ccdbc",
        "postedAt": "vor 2 Tagen",
        "scrapedAt": "2024-12-02T15:05:32.998Z",
        "postingDateParsed": "2024-11-29T20:23:29.000Z",
        "description": "Diabolocom enables organizations worldwide to build brand loyalty and drive sales growth. Our innovative cloud-based solution leverages its proprietary AI technologies to optimize contact centers of medium to large sizes, enabling efficient management of customer interactions across all communication channels. As a telecom operator, we ensure premium voice quality, efficient handling of high call volumes, and provide phone numbers worldwide.\n\nOur comprehensive range of AI services, specifically designed for customer relations, elevates data quality and automates tasks. These services, fully integrated into our cloud contact center solutions, are also accessible through APIs in multiple languages.\n\nWe empower Customer Service and Sales teams to effectively handle all inbound and outbound interactions thanks to our state-of-the-art dialer. Our solution seamlessly integrateswith leading CRMs and offers real-time monitoring and analytics capabilities.\n\nDiabolocom, with offices across Europe, the USA, Brazil, and the UAE, proudly serves 350+ clients, with agents operating from 60+ countries.\n\nAbout the Role:\n\nDiabolocom is seeking a skilled and experienced Software Engineer (Golang) to join its Software Engineering team. This role is crucial for developing new backend services and enhancing customer communication channels, including chats, SMS, WhatsApp, and\nsupport for email services.\n\nYour Responsibilities:\n\n· Develop microservices and adapters for specific written channels (chats, SMS, WhatsApp).\n· Collaborate with Backend/Frontend Developers and Product Owners to deliver high quality solutions.\n· Mentor Team Members in GoLang best practices to facilitate skill development within the team.\n\nWhat We're Looking For:\n\n· Minimum 5 years of experience in backend development.\n· Strong proficiency in GoLang with at least 3 years of hands-on experience.\n· Experience with microservice architecture and API design.\n· Knowledge of cloud-native infrastructure and CI/CD tools is a plus.\n· Fluent in English, both written and spoken.\n\nWhat's in it for You:\n\n· Work in a multicultural environment with colleagues from 8 different countries and 10 nationalities.\n· First choice IT equipment and a central office location in Paris near the Opera Garnier.\n· Remote-friendly work environment.\n· Swile card for lunch vouchers.\n· Team building events in exciting locations like Ibiza, Porquerolles, and Corsica.\n· Opportunity to contribute to a growing company with ample career development\n· prospects.\n· A culture where your ideas are valued and contribute directly to the organization's\n· success.\n· Continuous learning and growth opportunities.\n\nRecruitment Process:\n\n· Technical challenge on HackerRank platform to assess general level\n· Call with a Talent Acquisition Manager\n· Live coding challenge and design interview through screen sharing with our Lead Software Engineer\n· Call with Alexander, our Head of Software Engineering",
        "descriptionHTML": "<div><div>Diabolocom enables organizations worldwide to build brand loyalty and drive sales growth. Our innovative cloud-based solution leverages its proprietary AI technologies to optimize contact centers of medium to large sizes, enabling efficient management of customer interactions across all communication channels. As a telecom operator, we ensure premium voice quality, efficient handling of high call volumes, and provide phone numbers worldwide.</div><div></div><div><br>\nOur comprehensive range of AI services, specifically designed for customer relations, elevates data quality and automates tasks. These services, fully integrated into our cloud contact center solutions, are also accessible through APIs in multiple languages.</div><div></div><div><br>\nWe empower Customer Service and Sales teams to effectively handle all inbound and outbound interactions thanks to our state-of-the-art dialer. Our solution seamlessly integrateswith leading CRMs and offers real-time monitoring and analytics capabilities.</div><div></div><div><br>\nDiabolocom, with offices across Europe, the USA, Brazil, and the UAE, proudly serves 350+ clients, with agents operating from 60+ countries.</div><div></div><div><b><br>\nAbout the Role:</b></div><div></div><div><br>\nDiabolocom is seeking a skilled and experienced Software Engineer (Golang) to join its Software Engineering team. This role is crucial for developing new backend services and enhancing customer communication channels, including chats, SMS, WhatsApp, and\n</div><div>support for email services.</div><div></div><div><b><br>\nYour Responsibilities:</b></div><div></div><ul><li><br>\nDevelop microservices and adapters for specific written channels (chats, SMS, WhatsApp).\n</li><li>Collaborate with Backend/Frontend Developers and Product Owners to deliver high quality solutions.</li><li>Mentor Team Members in GoLang best practices to facilitate skill development within the team.<br>\n</li></ul><div></div><br>\n<div><b>What We're Looking For:</b></div><div></div><ul><li><br>\nMinimum 5 years of experience in backend development.</li><li>Strong proficiency in GoLang with at least 3 years of hands-on experience.</li><li>Experience with microservice architecture and API design.</li><li>Knowledge of cloud-native infrastructure and CI/CD tools is a plus.</li><li>Fluent in English, both written and spoken.</li></ul><div></div><div><b><br>\nWhat's in it for You:</b></div><div></div><ul><li><br>\nWork in a multicultural environment with colleagues from 8 different countries and 10 nationalities.</li><li>First choice IT equipment and a central office location in Paris near the Opera Garnier.</li><li>Remote-friendly work environment.</li><li>Swile card for lunch vouchers.</li><li>Team building events in exciting locations like Ibiza, Porquerolles, and Corsica.</li><li>Opportunity to contribute to a growing company with ample career development</li><li>prospects.</li><li>A culture where your ideas are valued and contribute directly to the organization's</li><li>success.</li><li>Continuous learning and growth opportunities.</li></ul><div>\n</div><div><b>\nRecruitment Process:</b></div><div></div><ul><li><br>\nTechnical challenge on HackerRank platform to assess general level</li><li>Call with a Talent Acquisition Manager</li><li>Live coding challenge and design interview through screen sharing with our Lead Software Engineer</li><li>Call with Alexander, our Head of Software Engineering</li></ul></div>",
        "externalApplyLink": null,
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Front-end Engineer – full remote or Hybrid",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "Diabolocom",
        "location": "München",
        "rating": 4.7,
        "reviewsCount": 3,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=b9e5b6ff12112754",
        "id": "b9e5b6ff12112754",
        "postedAt": "vor 2 Tagen",
        "scrapedAt": "2024-12-02T15:05:33.603Z",
        "postingDateParsed": "2024-11-29T20:23:28.000Z",
        "description": "Diabolocom enables organizations worldwide to build brand loyalty and drive sales growth. Our innovative cloud-based solution leverages its proprietary AI technologies to optimize contact centers of medium to large sizes, enabling efficient management of customer interactions across all communication channels. As a telecom operator, we ensure premium voice quality, efficient handling of high call volumes, and provide phone numbers worldwide.\n\nOur comprehensive range of AI services, specifically designed for customer relations, elevates data quality and automates tasks. These services, fully integrated into our cloud contact center solutions, are also accessible through APIs in multiple languages.\n\nWe empower Customer Service and Sales teams to effectively handle all inbound and outbound interactions thanks to our state-of-the-art dialer. Our solution seamlessly integrates with leading CRMs and offers real-time monitoring and analytics capabilities.\n\nDiabolocom, with offices across Europe, the USA, Brazil, and the UAE, proudly serves 350+ clients, with agents operating from 60+ countries.\n\nAbout the Role:\n\nDiabolocom, a leading French software and telecom company, is seeking a Frontend Software Engineer to join our team. This is a fully remote position, with the option to work in a hybrid setting from our Paris office, if preferred.\n\nYou will join an international team of Software Engineers, Voip Engineers, QAs, and SREs to develop the cloud contact center platform.\n\nProject:\n\n· Omnichannel cloud solution for call centers and sales teams.\n· Tech Stack and Approaches: Angular, NgRX, Typescript, Nx, Jest, Microfrontend, No-Code.\n\n‍What we are looking for:\n\n· Strong knowledge of JavaScript. We use Typescript, Angular, NgRx.\n· Experience with REST APIs\n· Skills of testing and debugging code\n· Spoken English\n\nAt Diabolocom, you will:\n\n· Create dynamic user interfaces to manage real-time critical operations\n· Improve our frontend architecture with a focus on performance, automation and auditing\n· Integrate our solution with +10 CRM solutions and 3rd party systems\n\nWhat’s in it for you:\n\n· A multicultural environment with teams in 5 countries across Europe (and expanding).\n· We are at a pivotal stage in our development with a significant acceleration of our growth and paradigm shift\n\nRecruitment process:\n\n· Code challenge at HackerRank\n· Intro call with a recruiter\n· Technical evaluation: Live coding interview and System Design interview\n· Call with Andrey, our Principal Software Engineer\n· Call with Alexander, our Head of Software Engineering\n· Offer\nAt Diabolocom, diversity and inclusion are in our DNA. All qualified applicants will receive equal consideration for employment without regard to color, language, religion, sex, sexual orientation, gender identity, national or social origin, opinion disability, age.",
        "descriptionHTML": "<div><div>Diabolocom enables organizations worldwide to build brand loyalty and drive sales growth. Our innovative cloud-based solution leverages its proprietary AI technologies to optimize contact centers of medium to large sizes, enabling efficient management of customer interactions across all communication channels. As a telecom operator, we ensure premium voice quality, efficient handling of high call volumes, and provide phone numbers worldwide.</div><div></div><div><br>\nOur comprehensive range of AI services, specifically designed for customer relations, elevates data quality and automates tasks. These services, fully integrated into our cloud contact center solutions, are also accessible through APIs in multiple languages.</div><div></div><div><br>\nWe empower Customer Service and Sales teams to effectively handle all inbound and outbound interactions thanks to our state-of-the-art dialer. Our solution seamlessly integrates with leading CRMs and offers real-time monitoring and analytics capabilities.</div><div></div><div><br>\nDiabolocom, with offices across Europe, the USA, Brazil, and the UAE, proudly serves 350+ clients, with agents operating from 60+ countries.</div><div></div><div><b><br>\nAbout the Role:<br>\n</b></div><div></div><br>\n<div>Diabolocom, a leading French software and telecom company, is seeking a Frontend Software Engineer to join our team. This is a fully remote position, with the option to work in a hybrid setting from our Paris office, if preferred.</div><div></div><div><br>\nYou will join an international team of Software Engineers, Voip Engineers, QAs, and SREs to develop the cloud contact center platform.</div><div></div><div><b><br>\nProject:</b></div><div>\n</div><ul><li>Omnichannel cloud solution for call centers and sales teams.</li><li>Tech Stack and Approaches: Angular, NgRX, Typescript, Nx, Jest, Microfrontend, No-Code.</li></ul><div></div><div><b><br>\n&zwj;What we are looking for:</b></div><div></div><ul><li><br>\nStrong knowledge of JavaScript. We use Typescript, Angular, NgRx.</li><li>Experience with REST APIs</li><li>Skills of testing and debugging code</li><li>Spoken English</li></ul><div></div><div><b><br>\nAt Diabolocom, you will:</b></div><div></div><ul><li><br>\nCreate dynamic user interfaces to manage real-time critical operations</li><li>Improve our frontend architecture with a focus on performance, automation and auditing</li><li>Integrate our solution with +10 CRM solutions and 3rd party systems</li></ul><div></div><div><b><br>\nWhat&rsquo;s in it for you:</b></div><div></div><ul><li><br>\nA multicultural environment with teams in 5 countries across Europe (and expanding).</li><li>We are at a pivotal stage in our development with a significant acceleration of our growth and paradigm shift</li></ul><div></div><div><b><br>\nRecruitment process:</b></div><div></div><ul><li><br>\nCode challenge at HackerRank</li><li>Intro call with a recruiter</li><li>Technical evaluation: Live coding interview and System Design interview</li><li>Call with Andrey, our Principal Software Engineer</li><li>Call with Alexander, our Head of Software Engineering\n</li><li>Offer</li></ul>\n<div>At Diabolocom, diversity and inclusion are in our DNA. All qualified applicants will receive equal consideration for employment without regard to color, language, religion, sex, sexual orientation, gender identity, national or social origin, opinion disability, age.</div></div>",
        "externalApplyLink": null,
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Systems Development Engineer, Customer Deployments",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "Google",
        "location": "München",
        "rating": 4.3,
        "reviewsCount": 5753,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=8d69f96ab24546ba",
        "id": "8d69f96ab24546ba",
        "postedAt": "vor 2 Tagen",
        "scrapedAt": "2024-12-02T15:05:29.438Z",
        "postingDateParsed": "2024-11-29T20:18:00.000Z",
        "description": "Minimum qualifications:\n\n• Bachelor's degree in Computer Science or equivalent practical experience.\n• 5 years of experience working in production distributed environments.\n• Experience in TCP/IP and networking concepts (PXE boot, Subnets, VLANs, Jumbo Frames, LACP, NIC Teaming, Unicast/Broadcast/Multicast, ACLs, DNS, DHCP, SSH, etc.).\n• Experience in one of the areas of infrastructure (e.g., Linux, Kubernetes, Networking, Storage, etc.).\n• Due to the sensitive nature of this role, candidates must be able to obtain and maintain a Level 2 security clearance (SÜ2) under the German Classification Act (SÜG).\n\nPreferred qualifications:\n\n• Experience working as a Customer Solution Engineer.\n• Experience in SRE or IT production systems engineering.\n• Understanding of physical server, storage and network devices scripting (Bash, Perl, Python, Ruby, etc.) to help with automation of routine tasks.\n• Excellent relationship-building skills, with the ability to empathize with customers and understand their needs.\n• Excellent problem-solving skills.\n• Ability to travel internationally up to 25% of the time.\n\nAbout the job\n\nSystems Development Engineering (SDE) at Google is a role where you manage services and systems at scale. SDEs creatively put their engineering discipline to use automating the mundane and reducing toil. We don’t just write code to fix bugs, but emphasize the development of tools and solutions that fix classes of problems. We know it’s hard to control what you can’t measure – so we focus on observability: instrumenting first, then turning data into knowledge, and finally knowledge into action. We know that the operational efficiency of Google systems, services, virtual compute environments and the operating systems that power them impact the environment, not just the bottom line. We know that working together we can do more, and that community matters.Google brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow.Together we engineer and build the infrastructure, tools, access and telemetry for systems that enable orchestration of Google-scale services. Come build things that matter.\nGDCH is a turnkey private cloud offering. It includes everything you need to launch a cloud offering, including software, hardware, tools, operating process, runbooks, and training. As a Systems Development Engineer, you will be responsible for deploying GDCH solutions at customer sites as well as internal reference deployments. You will build deep expertise in deploying and operating Google Distributed Cloud Hosted (GDCH) solutions.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nResponsibilities\n\n• Perform complex day to day troubleshooting and resolution of Infrastructure issues (Network, Storage, Servers, OS, Kubernetes, etc.).\n• Participate in Customer, Partner, and Internal team Deployments and training which will require international travel.\n• Deliver train-the-trainer programs to equip Google partners with the knowledge and skills to effectively conduct customer deployments independently.\n• Participate in the 24x7 on-call rotation to support escalations from client deployments as well as internal reference deployments.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See alsoGoogle's EEO Policy andEEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing ourAccommodations for Applicants form.",
        "descriptionHTML": "<b>Minimum qualifications:</b><br>\n<ul>\n<li>Bachelor's degree in Computer Science or equivalent practical experience.</li>\n<li>5 years of experience working in production distributed environments.</li>\n<li>Experience in TCP/IP and networking concepts (PXE boot, Subnets, VLANs, Jumbo Frames, LACP, NIC Teaming, Unicast/Broadcast/Multicast, ACLs, DNS, DHCP, SSH, etc.).</li>\n<li>Experience in one of the areas of infrastructure (e.g., Linux, Kubernetes, Networking, Storage, etc.).</li>\n<li>Due to the sensitive nature of this role, candidates must be able to obtain and maintain a Level 2 security clearance (SÜ2) under the German Classification Act (SÜG).</li>\n</ul>\n<b>Preferred qualifications:</b><br>\n<ul>\n<li>Experience working as a Customer Solution Engineer.</li>\n<li>Experience in SRE or IT production systems engineering.</li>\n<li>Understanding of physical server, storage and network devices scripting (Bash, Perl, Python, Ruby, etc.) to help with automation of routine tasks.</li>\n<li>Excellent relationship-building skills, with the ability to empathize with customers and understand their needs.</li>\n<li>Excellent problem-solving skills.</li>\n<li>Ability to travel internationally up to 25% of the time.</li>\n</ul>\nAbout the job\n<br><br>\nSystems Development Engineering (SDE) at Google is a role where you manage services and systems at scale. SDEs creatively put their engineering discipline to use automating the mundane and reducing toil. We don’t just write code to fix bugs, but emphasize the development of tools and solutions that fix classes of problems. We know it’s hard to control what you can’t measure – so we focus on observability: instrumenting first, then turning data into knowledge, and finally knowledge into action. We know that the operational efficiency of Google systems, services, virtual compute environments and the operating systems that power them impact the environment, not just the bottom line. We know that working together we can do more, and that community matters.Google brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow.Together we engineer and build the infrastructure, tools, access and telemetry for systems that enable orchestration of Google-scale services. Come build things that matter.\n<br>GDCH is a turnkey private cloud offering. It includes everything you need to launch a cloud offering, including software, hardware, tools, operating process, runbooks, and training. As a Systems Development Engineer, you will be responsible for deploying GDCH solutions at customer sites as well as internal reference deployments. You will build deep expertise in deploying and operating Google Distributed Cloud Hosted (GDCH) solutions.\n<br>Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n<br><br>\nResponsibilities\n<br><br>\n<ul>\n<li>Perform complex day to day troubleshooting and resolution of Infrastructure issues (Network, Storage, Servers, OS, Kubernetes, etc.).</li>\n<li>Participate in Customer, Partner, and Internal team Deployments and training which will require international travel.</li>\n<li>Deliver train-the-trainer programs to equip Google partners with the knowledge and skills to effectively conduct customer deployments independently.</li>\n<li>Participate in the 24x7 on-call rotation to support escalations from client deployments as well as internal reference deployments.</li>\n</ul>\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See alsoGoogle's EEO Policy andEEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing ourAccommodations for Applicants form.",
        "externalApplyLink": "https://www.google.com/about/careers/applications/jobs/results/121699671520223942-systems-development-engineer/?src=Online/Job%20Board/indeed&utm_source=indeed&utm_medium=job-posting",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Lead, Software Engineering, Embedded OS Platform Team",
        "salary": null,
        "jobType": [],
        "company": "Unity Technologies",
        "location": "München",
        "rating": 3.5,
        "reviewsCount": 45,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=2c924e6747fd29ff",
        "id": "2c924e6747fd29ff",
        "postedAt": "vor 2 Tagen",
        "scrapedAt": "2024-12-02T15:05:37.818Z",
        "postingDateParsed": "2024-11-29T18:19:37.000Z",
        "description": "The opportunity\nAdvances in embedded hardware and operating systems bring real-time 3D to pixels on every screen. Users will expect stunning interactive experiences everywhere: from in-car infotainment systems and digital cockpits to touch-screen kiosks in showrooms and at sporting events. Unity is at the forefront with our scalable, performant runtime engine and Unity Editor workflow.\n\nWe are looking for a manager for the Embedded OS Platform engineering team which delivers the platform-specific foundation underlying the Unity engine. The team supports Embedded Linux (e.g. Yocto), QNX, and Android solutions. The manager will drive the highest quality standards, including maintaining our ISO 9001 certification.\n\nThis role combines technical leadership with people management. The right person will help us develop and retain high-quality engineering talent. If you thrive on shaping software that is loved and used by millions and leading the engineers who build and maintain it, then we've got a great job opportunity for you!\n\nWhat you'll be doing\n\nOwn and drive the technical strategy for the team\nWork closely with Product Management to develop the embedded OS platform layer which scales across various operating systems\nCollaborate with Sales, Business Development, and Solutions teams to deliver a performant platform that meet customer requirements\nSupport the members of your engineering team as they advance in their career goals\nCommunicate your team's vision and progress internally and externally\nThis role will include interaction with customer and partner engineering teams\n\nWhat we're looking for\n\nExperience coaching and managing an effective software engineering team\nExperience with Embedded solutions, platforms, and operating systems\nWorking familiarity with C++ and Linux\n\nYou might also have\n\nExperience with Real-Time 3D projects or games\nExpertise leading using Agile development methodologies\nExperience collaborating with distributed teams around the world\nExperience working with Yocto build environments\n\nAdditional information\n\nRelocation support is not available for this position.\nWork visa/immigration sponsorship is not available for this position\n\nLife at Unity\nUnity [NYSE: U] is the world's leading platform of tools for creators to build and grow real-time games, apps, and experiences across multiple platforms. Creators, ranging from game developers to artists, architects, automotive designers, infrastructure experts, filmmakers, and more, use Unity to bring their imaginations to life across multiple platforms, from mobile, PC, and console, to spatial computing.\n\nAs of the fourth quarter of 2023, more than 69% of the top 1,000 mobile games are made with Unity as derived from a blended number of the top 1,000 games in the Google Play Store and iOS App Store. In 2023, Made with Unity applications had an average of 3.7 billion downloads per month. For more information, please visit Unity.\n\nUnity is a proud equal opportunity employer. We are committed to fostering an inclusive, innovative environment and celebrate our employees across age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. Our differences are strengths that enable us to support the growing and evolving needs of our customers, partners, and collaborators. If there are preparations or accommodations we can make to help ensure you have a comfortable and positive interview experience, please fill out this form to let us know.\n\nThis position requires the incumbent to have a sufficient knowledge of English to have professional verbal and written exchanges in this language since the performance of the duties related to this position requires frequent and regular communication with colleagues and partners located worldwide and whose common language is English.\n\nHeadhunters and recruitment agencies may not submit resumes/CVs through this website or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.\n\nYour privacy is important to us. Please take a moment to review our Prospect Privacy Policy and Applicant Privacy Policy. Should you have any concerns about your privacy, please contact us at DPO@unity.com.\n\n#SEN",
        "descriptionHTML": "<div><p><b>The opportunity</b><br>\nAdvances in embedded hardware and operating systems bring real-time 3D to pixels on every screen. Users will expect stunning interactive experiences everywhere: from in-car infotainment systems and digital cockpits to touch-screen kiosks in showrooms and at sporting events. Unity is at the forefront with our scalable, performant runtime engine and Unity Editor workflow.</p><p>\nWe are looking for a manager for the Embedded OS Platform engineering team which delivers the platform-specific foundation underlying the Unity engine. The team supports Embedded Linux (e.g. Yocto), QNX, and Android solutions. The manager will drive the highest quality standards, including maintaining our ISO 9001 certification.</p><p>\nThis role combines technical leadership with people management. The right person will help us develop and retain high-quality engineering talent. If you thrive on shaping software that is loved and used by millions and leading the engineers who build and maintain it, then we've got a great job opportunity for you!</p><p><b>\nWhat you'll be doing</b></p><ul><li>\nOwn and drive the technical strategy for the team</li><li>\nWork closely with Product Management to develop the embedded OS platform layer which scales across various operating systems</li><li>\nCollaborate with Sales, Business Development, and Solutions teams to deliver a performant platform that meet customer requirements</li><li>\nSupport the members of your engineering team as they advance in their career goals</li><li>\nCommunicate your team's vision and progress internally and externally</li><li>\nThis role will include interaction with customer and partner engineering teams</li></ul><p><b>\nWhat we're looking for</b></p><ul><li>\nExperience coaching and managing an effective software engineering team</li><li>\nExperience with Embedded solutions, platforms, and operating systems</li><li>\nWorking familiarity with C++ and Linux</li></ul><p><b>\nYou might also have</b></p><ul><li>\nExperience with Real-Time 3D projects or games</li><li>\nExpertise leading using Agile development methodologies</li><li>\nExperience collaborating with distributed teams around the world</li><li>\nExperience working with Yocto build environments</li></ul><p><b>\nAdditional information</b></p><ul><li>\nRelocation support is not available for this position.</li><li>\nWork visa/immigration sponsorship is not available for this position</li></ul><p><b>\nLife at Unity</b><br>\nUnity [NYSE: U] is the world's leading platform of tools for creators to build and grow real-time games, apps, and experiences across multiple platforms. Creators, ranging from game developers to artists, architects, automotive designers, infrastructure experts, filmmakers, and more, use Unity to bring their imaginations to life across multiple platforms, from mobile, PC, and console, to spatial computing.</p><p>\nAs of the fourth quarter of 2023, more than 69% of the top 1,000 mobile games are made with Unity as derived from a blended number of the top 1,000 games in the Google Play Store and iOS App Store. In 2023, Made with Unity applications had an average of 3.7 billion downloads per month. For more information, please visit Unity.</p><p><i>\nUnity is a proud equal opportunity employer. We are committed to fostering an inclusive, innovative environment and celebrate our employees across age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. Our differences are strengths that enable us to support the growing and evolving needs of our customers, partners, and collaborators. If there are preparations or accommodations we can make to help ensure you have a comfortable and positive interview experience, please fill out </i><i>this form</i><i> to let us know.</i></p><p><i>\nThis position requires the incumbent to have a sufficient knowledge of English to have professional verbal and written exchanges in this language since the performance of the duties related to this position requires frequent and regular communication with colleagues and partners located worldwide and whose common language is English.</i></p><p><i>\nHeadhunters and recruitment agencies may not submit resumes/CVs through this website or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.</i></p><p><i>\nYour privacy is important to us. Please take a moment to review our </i><i>Prospect Privacy Policy</i><i> and </i><i>Applicant Privacy Policy</i><i>. Should you have any concerns about your privacy, please contact us at DPO@unity.com.</i></p><p>\n#SEN</p></div>",
        "externalApplyLink": "https://de.indeed.com/rc/clk?jk=2c924e6747fd29ff&bb=UQ9M8AQTAoHmsJUIX0btL7ff9IVZ6GRDedbxxDk8ZOYrCpIfLrUggVrR9ea1KNNj&xkcb=SoDi67M34D0xVVACIL0GbzkdCdPP&fromas=1&xpse=SoDb67I34D0xC4R7oB0LbzkdCdPP&xfps=4f7f39ad-e958-47f5-b223-7afc8041cb48",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Senior Software Engineer",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "Corpay",
        "location": "Starnberg",
        "rating": 3.1,
        "reviewsCount": 907,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=33846c6fdd55eff4",
        "id": "33846c6fdd55eff4",
        "postedAt": "vor 2 Tagen",
        "scrapedAt": "2024-12-02T15:05:38.994Z",
        "postingDateParsed": "2024-11-29T16:10:44.000Z",
        "description": "Your role\nYou will be joining Business Gateway GmbH, a leading and innovative software solutions business\n\nBG drives the fleet automotive industry forward with technology solutions enabling the servicing, repair and tire fitments of nearly 1 million vehicles a year. Our ecosystem brings vehicle rental, leasing companies, tire, repair and service networks together through market leasing authorisation systems\n\nBased in the office near Munich you will encounter a diverse role that will require you to become a business expert in everything within the software application.\nWhat you'll be doing\n\n· You implement the complex requirements of our customers in our applications\n\n· Analysis of the customer's requirements\n\n· Implementation of the created requirements/concept in our system\n\n· You write scripts in XSLT format\n\n· Accompanying customer projects even after implementation and initiate further development phases\n\n· Develop new features and optimize existing features\n\nExperience\n\n· Ideally training IT specialists - Application development\n\n· Professional experience in development with XSLT, ideally in the automotive environment\n\n· Understanding and prior use of Business Process Management (BPM) tools\n\n· Required knowledge of XSL, XSLT, XML, XPATH, XQuery\n\n· Database knowledge MySQL\n\n· Programming language skills in PHP and server skills Linux\n\n· Dealing with ticketing systems\n\n· They are strong in organisation and work reliably and structured\n\n· You are able to quickly get involved in new technical topics\n\n· Self-employed but team-oriented way of working\n\n· Communication skills\n\n· Language skills: very good Knowledge of German and fluent English\n\nCharacteristics\n\n· Detail orientated\n\n· Enjoy the build and support processes for software\n\n· Assertive, team player, multi-tasking\n\nBenefits\n\n· 25 days annual leave + bank holidays\n\n· Life insurance\n\n· Health\n\n· Opportunity to work with great people\n\n· Flexibility in your working life\n\nAbout Corpay\n\nCorpay is a global technology organisation that is leading the future of commercial payments with a culture of innovation that drives us to constantly create new and better ways to pay. Our specialized payment solutions help businesses control, simplify, and secure payment for fuel, general payables, toll and lodging expenses. Millions of people in over 80 countries around the world use our solutions for their payments.\n\nAll offers of employment made by Corpay (and its subsidiary companies) are subject to the successful completion of satisfactory pre-employment vetting by an independent supplier (Experian). This is in accordance with Corpay's Resourcing Policy and include employment referencing, identity, adverse financial, criminal and sanctions list checks. We do this to meet our legal and regulatory requirements.\n\nCorpay is dedicated to encouraging a supportive and inclusive culture among our employees. It is within our best interest to promote diversity and eliminate discrimination in the workplace. We seek to ensure that all employees and job applicants are given equal opportunities.\n\nNotice to Agency and Search Firm Representatives: Corpay will not accept unsolicited CV's from agencies and/or search firms for this job posting. Resumes submitted to any Corpay employee by a third party agency and/or search firm without a valid written & signed search agreement, will become the sole property of Corpay. No fee will be paid if a candidate is hired for this position as a result of an unsolicited agency or search firm referral. Thank you.",
        "descriptionHTML": "<div></div><div><div>Your role</div>\nYou will be joining Business Gateway GmbH, a leading and innovative software solutions business<br>\n<br>\nBG drives the fleet automotive industry forward with technology solutions enabling the servicing, repair and tire fitments of nearly 1 million vehicles a year. Our ecosystem brings vehicle rental, leasing companies, tire, repair and service networks together through market leasing authorisation systems<br>\n<br>\nBased in the office near Munich you will encounter a diverse role that will require you to become a business expert in everything within the software application.<div></div><div>\nWhat you'll be doing</div><div></div><ul><li>You implement the complex requirements of our customers in our applications</li><li>Analysis of the customer's requirements</li><li>Implementation of the created requirements/concept in our system</li><li>You write scripts in XSLT format</li><li>Accompanying customer projects even after implementation and initiate further development phases</li><li>Develop new features and optimize existing features</li></ul><div></div><div>\nExperience</div><ul><li>Ideally training IT specialists - Application development</li><li>Professional experience in development with XSLT, ideally in the automotive environment</li><li>Understanding and prior use of Business Process Management (BPM) tools</li><li>Required knowledge of XSL, XSLT, XML, XPATH, XQuery</li><li>Database knowledge MySQL</li><li>Programming language skills in PHP and server skills Linux</li><li>Dealing with ticketing systems</li><li>They are strong in organisation and work reliably and structured</li><li>You are able to quickly get involved in new technical topics</li><li>Self-employed but team-oriented way of working</li><li>Communication skills</li><li>Language skills: very good Knowledge of German and fluent English</li></ul><div></div><div>\nCharacteristics</div><ul><li>Detail orientated</li><li>Enjoy the build and support processes for software</li><li>Assertive, team player, multi-tasking</li></ul><div></div><div>\nBenefits</div><ul><li>25 days annual leave + bank holidays</li><li>Life insurance</li><li>Health</li><li>Opportunity to work with great people</li><li>Flexibility in your working life</li></ul><div></div><div>\nAbout Corpay</div><div></div><div>\nCorpay is a global technology organisation that is leading the future of commercial payments with a culture of innovation that drives us to constantly create new and better ways to pay. Our specialized payment solutions help businesses control, simplify, and secure payment for fuel, general payables, toll and lodging expenses. Millions of people in over 80 countries around the world use our solutions for their payments.</div><div></div><div>\nAll offers of employment made by Corpay (and its subsidiary companies) are subject to the successful completion of satisfactory pre-employment vetting by an independent supplier (Experian). This is in accordance with Corpay's Resourcing Policy and include employment referencing, identity, adverse financial, criminal and sanctions list checks. We do this to meet our legal and regulatory requirements.</div><div>\nCorpay is dedicated to encouraging a supportive and inclusive culture among our employees. It is within our best interest to promote diversity and eliminate discrimination in the workplace. We seek to ensure that all employees and job applicants are given equal opportunities.</div><div></div><div>\nNotice to Agency and Search Firm Representatives: Corpay will not accept unsolicited CV's from agencies and/or search firms for this job posting. Resumes submitted to any Corpay employee by a third party agency and/or search firm without a valid written &amp; signed search agreement, will become the sole property of Corpay. No fee will be paid if a candidate is hired for this position as a result of an unsolicited agency or search firm referral. Thank you.</div></div><div></div>",
        "externalApplyLink": "https://de.indeed.com/rc/clk?jk=33846c6fdd55eff4&bb=07D-cRwQIUmrHkv9gqr57bqMx25B4V-Q9Z_Qg8kNUuWsfA5gwrShCqN4YVNcUdC7&xkcb=SoB767M34D0xY3zb1B0QbzkdCdPP&fromas=1&xpse=SoCI67I34D0xKBSNrx0LbzkdCdPP&xfps=5ffdcd8d-50d0-47fc-8fb8-b31bef898a72",
        "searchInput": null,
        "isExpired": false
    },
    {
        "positionName": "Functional Safety Technical Lead - ADAS (m/f/d)",
        "salary": null,
        "jobType": [
            "Vollzeit"
        ],
        "company": "KPIT Technologies GmbH",
        "location": "München",
        "rating": 3.7,
        "reviewsCount": 666,
        "urlInput": "https://de.indeed.com/Jobs?q=Software+Engineer&l=München&radius=50&lang=en&vjk=4a69265aa7d38c7b&sort=date",
        "url": "https://de.indeed.com/viewjob?jk=a48b143138a2bba9",
        "id": "a48b143138a2bba9",
        "postedAt": "Gerade geschaltet",
        "scrapedAt": "2024-12-02T15:05:36.523Z",
        "postingDateParsed": "2024-12-02T09:29:45.000Z",
        "description": "Safety engineer is responsible for developing the safety concept and strategies/measures to mitigate risks for identified potential faults. This includes working on the high-level safety goals and translating it into a Technical Safety Concept.\n\nRole and Responsibilities:\n\nFeature enhancement/customization in platform layers/drivers to meet ASIL Safety compliance in Automotive ADAS\nCollaborate with cross-functional teams, engineering for smooth execution\nReview system safety architecture and its interfaces to investigate faults\nLead the FTA, DFA and FMEDA analysis\nWork with design/system engineers to develop and document module level functional safety requirements\nLead the DFMEA analysis of failure modes at the IP & integration level\n\nYour Profile:\n\nBachelor/ Master degree in electrical engineering, automotive engineering, embedded system or a similar\nMin. 6+ years experience in ISO26262/ Functional Safety\nStrong in C and Assembly Programming with OS & Multi-Processor concepts\nHands on experience on QNX/ RTOS\nHands on development experience in multi-threaded and multi-core environment\nExperience in ARMv7/v8 architecture, and ARM software development\nExperience in using debugging tools such as JTAG, Trace32\nBasic understanding of hardware blocks - Clocks, PLLs, GPIO, Interrupt Controllers (GIC), Power Management, Peripherals (SPI/I2C/UART/CAN/Ethernet/PCIe, etc)\nKnowledge of Software/Hardware Security concepts\nGood Communication and debugging skills\nAbility to collaborate and integrate with existing team\nFUSA,ISO 26262,QNX/RTOS,Debugging tools,C programming\nHardware blocks,German (B1)",
        "descriptionHTML": "<div><div>Safety engineer is responsible for developing the safety concept and strategies/measures to mitigate risks for identified potential faults. This includes working on the high-level safety goals and translating it into a Technical Safety Concept.<br>\n</div><div></div><div><b>Role and Responsibilities:\n</b></div><ul><li>Feature enhancement/customization in platform layers/drivers to meet ASIL Safety compliance in Automotive ADAS\n</li><li>Collaborate with cross-functional teams, engineering for smooth execution\n</li><li>Review system safety architecture and its interfaces to investigate faults\n</li><li>Lead the FTA, DFA and FMEDA analysis\n</li><li>Work with design/system engineers to develop and document module level functional safety requirements\n</li>Lead the DFMEA analysis of failure modes at the IP &amp; integration level<br>\n<li>\n</li></ul><div></div><div><b>Your Profile:\n</b></div><ul><li>Bachelor/ Master degree in electrical engineering, automotive engineering, embedded system or a similar\n</li><li>Min. 6+ years experience in ISO26262/ Functional Safety\n</li><li>Strong in C and Assembly Programming with OS &amp; Multi-Processor concepts\n</li><li>Hands on experience on QNX/ RTOS\n</li><li>Hands on development experience in multi-threaded and multi-core environment\n</li><li>Experience in ARMv7/v8 architecture, and ARM software development\n</li><li>Experience in using debugging tools such as JTAG, Trace32\n</li><li>Basic understanding of hardware blocks - Clocks, PLLs, GPIO, Interrupt Controllers (GIC), Power Management, Peripherals (SPI/I2C/UART/CAN/Ethernet/PCIe, etc)\n</li><li>Knowledge of Software/Hardware Security concepts\n</li><li>Good Communication and debugging skills\n</li><li>Ability to collaborate and integrate with existing team</li></ul></div><p></p>\n<br>FUSA,ISO 26262,QNX/RTOS,Debugging tools,C programming\n<br>Hardware blocks,German (B1)",
        "externalApplyLink": "https://talentojo.kpit.com/tojo/app/job-apply/#/Career%20Portal/73142",
        "searchInput": null,
        "isExpired": false
    }
]